[
  {
    "champion": "Aatrox",
    "title": "Aatrox (Character)",
    "abilities": "Aatrox regards most of his fellow Darkin as his brothers and sisters at arms, being honored among them when he acted as their general during the war. Though he participated in the war and most likely has slain some Darkin in the past, he deeply respects those that remained loyal to him prior to being imprisoned, regarding some of them as old friends and sympathizing with their imprisonment, promising them freedom by joining him on his quest for oblivion. Most recently, Aatrox has rallied most of his Darkin allies to gather in Icathia for a final battle against  Xolaani.[12] The Darkin that Aatrox rallied includes his honored captain  Joraal, one of his soldiers named  Taarosh, his old friends  Praa,  Baalkux,  Anaakca,  Horazi,  Naganeka and  Styraatu. Aside from them, Aatrox is implied to be one of five Darkin said to bring ruin to the whole world once they reunite, further implying that they all fought side by side during the war. Though not united, these Darkin are Aatrox himself,  Rhaast,  Varus,  Naafiri and an unknown fifth Darkin.[3] Rhaast is regarded as Aatrox's brother, being one of the five Darkin said to have fought alongside Aatrox during the war and destined to reunite and bring ruin to the world. Aatrox does not give Rhaast much respect, as he has yet to fully possesses his current host  Shieda Kayn and even criticizes his weapon of choice. Varus considers Aatrox his brother and is one of the five Darkin said to have fought alongside him during the war, destined to reunite and bring ruin to the world. Though the two share a desire the bring oblivion to the world, Aatrox considers Varus weak and unbecoming of a Darkin, claiming that he has become too human and succumbing to his mortal emotions, such as his need for revenge. It's implied there was some 'memo' given to Varus by Aatrox which explained that Varus had to use two A's in his name, officially naming him \"Vaarus.\" However, Varus thought the memo was absurd and refused to comply, angering and offending Aatrox.",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Ahri",
    "title": "Ahri (Character)",
    "abilities": "Since childhood, Ahri has observed human civilization from afar until she encountered a hunter dying from a stray arrow. Curiously sensing his fading life force, Ahri got her first taste of spiritual essence and absorbed the man's memories, gaining all his knowledge and experiences. Since then, Ahri hunted down human prey for years, drunkenly drinking their essence and learning to manipulate them with her charms. She slowly felt a sense of regret as she grew empathetic from absorbing human emotions, eventually seeing how they perceived her as a monstrous fox demon. Despite this, Ahri accepted her monstrous nature and continued to feast on human essence. It wasn't until she met her first and only love, a human artist, that she began to feel true sympathy for humans and decided to completely Now, after befriending  Yasuo and the rest of  Sarah Fortune's crew, she feels a deep sense of empathy and sympathy or her prey, sparing them from her hunger by learning to control it. Years ago, Ahri fell in love with a human artist who remains as her first and only true love. Unlike the rest of Ahri's prey, the artist was the first person to willingly offer his essence to Ahri in exchange for her love, to which she agreed. From there, she felt true happiness for the first time as the two would often lay in a lake at the edge of Ionia. Unfortunately, Ahri lost control of her hunger one day and accidentally drained her lover completely, thoroughly killing him. For years Ahri lived in constant regret over the death of her lover and attempted to remove the memories of him entirely at the Garden of Forgetting. In the process though, Ahri realized that her memories of her lover were too valuable to simply let go of and decided to live with them, no matter how painful it is to remember. Ahri finally found closure with the death of her lover when she cleansed the memories of her ancestors from the sunstones at the Buhru forge. In the process of this, Ahri sorrowed over the loss of the memories of her ancestors but was confronted with a memory of her lover, who urged Ahri to fight for the future and told her to live life to create new memories instead of dwelling on her old ones. This interaction defined Ahri, allowing her to live as she does now, as a protector of life in the same vein as her Vesani ancestors. Hirin was a fortune teller that Ahri encountered in an  Ionian market during her search for clues about her long-lost vastayan tribe. The fortune teller recognized Ahri's mysterious set of twin sunstones as the work of Ymelo, which intrigued Ahri as she agreed to enter her caravan for tea and to discuss more about her stones. Hirin revealed everything she knew about Ymelo to Ahri, before pulling out a hunting knife and revealing that she had put a paralysis potion in Ahri's cup of tea. Wishing to cut off one of her tails as an ingredient for her potions, Ahri managed to absorb enough of Hirin's essence to regain her strength and defend herself. Though she was furious at the betrayal, she looked into Hirin's memories and hardships in life, deciding to spare her life and leaving her without any memory of their encounter, essentially making her forget Ahri completely.",
    "positions": [
      "Mid"
    ]
  },
  {
    "champion": "Akali",
    "title": "Akali (Character)",
    "abilities": "Akali is currently a ninja gone rogue from the Kinkou Order. Although still part of it, she operates outside of its rules and regulations.[11] She and  Shen parted on neutral terms. Neither hates the other but both disapprove of the other's methods.[12] While growing up in the Kinkou,  Kennen trained her and helped her refine her shuriken techniques. Zed might attempt to recruit her for his Order of Shadows. Akali; however, wants him dead since many Kinkou members including her father Tahno were killed by him and his order. Akali and  Kayn know each other. He has tried to flirt with her multiple times and Akali finds him hot but too crazy for her taste. Akali temporarily teamed up with  Shen to track down  Jhin after they were informed of his escape. She later pursued Jhin to  Piltover- Zaun and got captured by him, but was later saved with the help of  Shen and  Zed. In the second  Noxian invasion of  Ionia,  Irelia's call for help to defend a seaside village from the Noxian army including  Sion was met by Akali,  Karma,  Kennen and  Yasuo whose arrival turned the tide of the battle.",
    "positions": [
      "Top",
      "Mid"
    ]
  },
  {
    "champion": "Akshan",
    "title": "Akshan (Character)",
    "abilities": "Shadya was the mentor and superior of Akshan. She revived Akshan with the use of the Absolver from the clutches of brutal warlords, recognizing his potential and dedication to fighting injustice. As a member of the  Sentinels of Light, Shadya imparted her knowledge and skills to Akshan, forging a strong bond between them. However, their relationship becomes strained when Shadya withholds information about the Absolver, a powerful relic gun she once used to save Akshan's life. Shadya's death at the hands of an unknown warlord becomes the catalyst for Akshan's journey of vengeance. Lucian is a seasoned  Sentinel of Light in search of the Absolver, a weapon that could both kill and revive. Initially seeking the relic for its potential in combating the Wraiths, Lucian encounters Akshan, who shares the story of Shadya's murder and his mission for retribution. Although Lucian attempts to recruit Akshan to the Sentinel cause, the young and vengeful Akshan remains resolute in his personal quest. Lucian's interactions with Akshan reveal a clash of ideologies and priorities, with the seasoned Sentinel trying to instill a sense of duty in the determined and rebellious Akshan. Akshan has mentioned that he sees a lot of Shadya in  Lucian. Akshan's initial encounter with  Senna is met with mixed reactions by the commanding officer of the  Sentinels of Light. She scolds Akshan for his dress code violations and is not sure this young Sentinel is up for the task. He would prove her wrong by mercy-killing  Isolde, thereby bringing back  Senna and  Gwen from death. Vayne's initial reaction to  Akshan's recruitment is met with disdain, wanting to kill him for his brash remarks towards her and other members of the  Sentinels of Light. After sealing of  Viego, she and him would stand on neutral terms, recognizing his abilities.",
    "positions": [
      "Mid"
    ]
  },
  {
    "champion": "Alistar",
    "title": "Alistar (Character)",
    "abilities": "After being captured and turned into a Reckoner for the arenas of the Noxian capital, Ayelia would visit Alistar in his cage every day as the first person to show the tortured and enslaved Minotaur true kindness. The two would slowly kindle a true friendship, sympathizing with the fact that both of them had lost their homes to the brutal expansions of the Noxian empire. Ayelia and Alistar eventually hatched an escape plan, managing to escape to a nearby cargo boat. Before they could escape, Noxians discovered the two and caused Alistar to enter a brutal rage in order to protect Ayelia, blindly fighting them off as she attempted to calm him down and call him to the now sailing boat. By the time Alistar regained his consciousness, Ayelia was gone along with the boat. Not knowing whether or not she had been killed or captured, Alistar fled southward by foot and, while inciting riots in Noxian territories, continually searches for and asks for Ayelia, intent on finding her. ",
    "positions": [
      "Support"
    ]
  },
  {
    "champion": "Ambessa",
    "title": "Ambessa (Character)",
    "abilities": "",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Amumu",
    "title": "Amumu (Character)",
    "abilities": "Though the validity of his tale is unclear, an old storyteller named Khaldun claims to his grandchildren that he survived an encounter with Amumu, having delved into his tomb and accidentally left it open once he escaped. According to Khaldun, Amumu's cursed touch withered away his arm with decay, being the reason behind his missing arm to this day.[2]",
    "positions": [
      "Jungle",
      "Support"
    ]
  },
  {
    "champion": "Anivia",
    "title": "Anivia (Character)",
    "abilities": "Anivia is one of the Freljordian demi-gods responsible for creating and forging the very land itself. All of the gods are siblings with one another, with Anivia being among one of the older ones. Anivia has not shown any true ill will to any of her fellow gods and is related to deities such as the Seal Sister and other currently unnamed spirits. Ornn is the eldest of the Freljordian demi-gods, being the god of the forge and magma. Ornn doesn't socialize with his siblings very much but hasn't shown any ill will towards Anivia. However, there are legends within the Freljord that tell of how Anivia, after Ornn felled her favorite perching tree, pulled a prank on Ornn in his sleep, causing him to sneeze a gout of flame and burn his house down. The legend states that he woke up in a grumpy mood, unaware of what Anivia had done.[4] The mighty Volibear, also known as Valhir, is the Freljordian demi-god of storms and warfare. Volibear interacted with Anivia when he called his siblings together to declare war on the ice witch  Lissandra. Many of the gods, especially Anivia, actually denied Volibear's proposal of war and was more inclined to cooperate with the mortals.[2] Despite this, and despite his violent nature, Volibear actually highly respects Anivia as a goddess. Though it's unsure whether or not Anivia has personally interacted with Lissandra, she is the one who moved to make peace with her instead of declaring war like her brother Volibear proposed. Anivia felt the ice witch's presence when she rallied her army of Iceborn to claim dominion over the Freljord, as followers of the old gods began to die out in her crusade to wipe out all of their worshippers.[1] Anivia hasn't personally interacted with Ashe, but she did appear before her at the mythical Avarosa's Throne, where Ashe found her signature True Ice bow.[6] Recently, word has spread that Ashe has actually gained the favor of Anivia herself as she sees in Ashe a way to truly reunite the Freljord. The Notai tribe highly revere Anivia in particular, having many stories and songs passed down for generations that speak of her many deeds and detailing her magnificent birth and rebirth within the world. They are nomadic and travel by following wherever the snow may fall, traveling along the waves of frost believed to fall off of Anivia's wings as she flies.[5]",
    "positions": [
      "Mid"
    ]
  },
  {
    "champion": "Annie",
    "title": "Annie (Character)",
    "abilities": "Tybaulk, known to Annie as 'Tibbers,' is the fire demon trapped within her stuffed teddy bear. Annie's mother Amoline initially contained Tybaulk within her own body, until she eventually placed him within Annie's teddy bear while magically curing her daughter's sudden illness. Tibbers is Annie's best friend and last companion due to the death of her entire family. Because her teddy bear is the only living piece of Annie's mother she has left, she is extremely fond of him and becomes enraged when someone tries to hurt or separate the two. Tybaulk on the other hand doesn't care much for Annie and serves only as an extension of her powers. However, he is impressed by her strong will as she is the first mortal he's met that has been capable of taming him.[7] Gregori was the loving father of Annie, nicknaming her 'Firefly' and raising her for most of her life after Amoline's sudden disappearance. After Gregori remarried, his love for Annie never faltered and he acted as the mediator between Annie and her new stepmother Leanna, who often came to odds with his daughter due to being disturbed by her abilities and strange tendencies. When the house burned down because of Annie's flames, Gregori remained concerned for his daughter's safety, ultimately sacrificing his own life to bring her to safety. Amoline was Annie's birth mother and had created Tibbers as a gift to her when she was born, having gone into labor with Annie while stitching the last button eye on the stuffed bear. When Annie gained a terrible fever, Amoline grew desparate to save her daughter from the illness and resorted to infusing her daughter with the powers of the demon  Tybaulk to save her, sacrificing her own life and mysteriously disappearing in the process. After Amoline's disappearance, Annie held on hope that her mother would one day return, constantly waiting for her at the fireplace while drawing pictures of her mother. Her obsession with her mother would grow disturbing however, such as one crayon drawing depicting her mother being buried underground implying she's aware that she most likely passed away. Tibbers is the last remaining piece of Amoline that Annie has left, causing her to be deeply connected to the stuffed bear to the point that anyone attempting to separate them would cause Annie's rageful outbursts. Daisy was Annie's stepsister, being the daughter of Leanna. Because the two were similar in age, they often got along and played together, but Daisy became frightened of Annie's temper and fiery powers. She grew a fear of Tibbers due to the fact that, at one point, Annie ignited Tibbers when Daisy attempted to take him to play a game.",
    "positions": [
      "Mid"
    ]
  },
  {
    "champion": "Aphelios",
    "title": "Aphelios (Character)",
    "abilities": "Aphelios and his twin sister were born within the Lunari faith during a rare convergence of the physical and spiritual moons, marking their births as significant and hailing them as children of destiny. Aphelios was a very devote follower to the Lunari, going through gruesome assassination training in his hope to protect them when threats against his people would arise. Despite this, he was infamously known for almost never socializing with anyone other than his sister. After the arrival of the Marus Omegnum, a major power shift from the heavens has begun to occur and caused an arising conflict between the Lunari and the rivaling  Solari. Communing with his sister from the spirit realm and equipped with an arsenal of moonstone weapons, Aphelios now faithfully serves as the weapon to protect the Lunari, assassinating key targets and defending his people from dangers. Alune and Aphelios share a profound and intimate bond as twin siblings, born during the convergence of the physical and spiritual moons within the Lunari faith. Their connection is rooted in their birth's significance and their subsequent training in separate disciplines that symbolize these twin moons. While Aphelios specialized in the art of assassination, honing his skills in stealth and combat, Alune devoted herself to mastering her magical talents as a seer. Despite their divergent paths, Aphelios found solace and companionship almost exclusively in his twin sister. The depth of their relationship was such that when Alune's training required her to leave the temple and separate from her brother, Aphelios was left without a purpose, embarking on a spiritual journey to find his orbit, ultimately leading to his discovery of the noctum flowers. When the Marus Omegnum manifested in the physical realm for the first time in centuries, Alune was chosen to inhabit it. Aphelios, who rarely attended anything at all in his typical loneliness, personally requested to attend the event and witness his sister passing into the spirit realm. Once the Solari discovered the gathered Lunari and attacked, the twins were forced to act fast and combined their abilities together. Aphelios drank the essence of the poisonous noctum and willingly became a conduit for Alune's enhanced magic from within the Marus Omegnum. Since then, the two work in unison as faithful agents to the Lunari as Aphelios, utilizing his combat training, carries out physical missions, while Alune guides him and provides him with his diverse arsenal. Although the twins exist in separate realms, they can only truly come together when Aphelios consumes the poisonous noctum, rendering himself mute and numbing his senses. In this state, Alune can spiritually project herself to commune with her brother while they share each other's thoughts, feelings, and senses. However, the bittersweet consequence is that Alune can never physically be in Aphelios's presence and Aphelios is unable to verbally communicate with her due to being mute in the process. Their bond is a paradox of immense closeness and profound distance. They mourn the circumstances that necessitate their reunion, as Aphelios sacrifices his physicality to allow Alune to commune with him, while Alune grieves over the pain Aphelios endures on his missions, dedicating herself entirely to protecting him.",
    "positions": [
      "ADC"
    ]
  },
  {
    "champion": "Ashe",
    "title": "Ashe (Character)",
    "abilities": "Ashe and  Sejuani were childhood friends but were separated when Ashe's mother offended Sejuani's grandmother about how she was raising Sejuani. They were eventually reunited as teenagers after Ashe's tribe was decimated by  Lissandra's frost priests, but the two had a falling out during a raid against a neighbor of the Winter's Claw. These neighbors, whom Ashe did not want to kill, would later become the first members of the new Avarosans. The two once saw each other as sisters. Legends of Runeterra cards suggest Ashe's Avarosan and  Trundle's trolls are in direct conflict which has resulted in a number of loss for the tribe. For that reason, Ashe wants the race to be exterminated. Anivia is the demigod that Ashe prays to the most and the one she has the deepest connection to. This is because she speaks the most to Ashe's hopes and beliefs.[2] Rumors say a recently hatched Anivia has met Ashe, and perhaps Anivia sees one who may be able to finally reunite the Freljord. It is unknown if  Nunu and  Willump support Ashe, but their deeds around the Freljord lead towards the same goal. Ashe and  Tryndamere are Bloodsworn, a political marriage, but the two eventually developed genuine affection for each other. Ashe originally married Tryndamere in order to avoid having to marry multiple suitors from neighboring tribes. All of this is, in turn, an inside reference at Riot. The name of Riot's co-founder Marc 'Tryndamere' Merrill's wife is Ashley. Unbeknownst to all,  Lissandra is the Ice Witch of Freljordian legend, who is actually waiting for the right moment to strike Ashe's and Sejuani's tribes and wipe out any potential incarnations of Avarosa and Serylda in order to take over the Freljord. As revealed by  Lissandra, she herself is one of the Three Sisters who led the Iceborn uprising against the Watchers. Whether or not she knows Ashe and  Sejuani are potentially direct descendants of her sisters (Avarosa and Serylda, respectively) making her their great-aunt-many-times-removed, is unknown.",
    "positions": [
      "ADC",
      "Support"
    ]
  },
  {
    "champion": "Aurelion Sol",
    "title": "Aurelion Sol (Character)",
    "abilities": "Aurelion Sol has several 'siblings' in the sense that they are celestial dragons like him, including 6 Inviolus Vox and 8 The Infinite Mindsplitter. 8 The Immortal Fire may also be a sibling. He has also created several constellations, including 1 The Charger, 3 The Trickster, 2 The Messenger, 10 The Scourge, 0 The Serpent, and 9 The Great Beyond. The Great Beyond is what Aurelion Sol considers his magnum opus, and he would like it to be the first to attack Mount Targon. He is fully aware of the existence of other celestial entities such as  Bard and  Soraka. Aurelion Sol hates the people of Targon and the Aspects, as they are the ones who enslaved him. Aurelion Sol has disdain for both the Solari and Lunari, and by extension Leona and Diana. This is because he sees their divisions as pointless, since moonlight is merely reflected sunlight. Aurelion Sol and Zoe are well-acquainted. She is the only Targonian Aspect that appears to offer him aid and protection from the Aspects' wrath. However, he often gets frustrated by her childish behavior and her insistence on him being her pet 'space doggy'.",
    "positions": [
      "Mid"
    ]
  },
  {
    "champion": "Aurora",
    "title": "Aurora (Character)",
    "abilities": "Aurora and Ornn are friends. They first met when Aurora entered Ornn's home in search of help for the spirit Haestryr. In order to assist her, Ornn forged Aurora's wand.",
    "positions": [
      "Mid",
      "Top"
    ]
  },
  {
    "champion": "Azir",
    "title": "Azir (Character)",
    "abilities": "Xerath's treachery made Azir furious at his former soul brother betraying his trust to become an Ascended being and destroying Shurima in the process. He can't let go because he truly loved his nation, however much his ambition may have led him astray. He can't accept responsibility for what happened to his kingdom - he blames Xerath, but was it really Xerath's fault...? Or was it the emperor who couldn't see the cruel intent of his most trusted advisor - and friend? And yes - for the moment, he is an emperor without an empire. An emperor without a people. He has nothing - but he'll do everything with his newfound power to change that, and rebuild Shurima into the thriving, powerful empire it once was. Given  Ezreal's exploration of the Shurima Desert and robbing of artifacts from its tombs, it's likely Azir won't be entirely fond of him. Azir dislikes  Sivir's graverobbing but does not resent her. She is family after all, and saving her from  Cassiopeia's backstabbing meant everything at the time of his revival. He would hold his hatred for Cassiopeia for almost ending his bloodline forever. When he was young, Azir was taught ancient knowledge from  Nasus and combat from  Renekton. The Ascended brothers' teachings will prove useful for the trials ahead. Azir is disappointed that a mighty warrior such as  Renekton has been reduced to a rabid beast after being tortured beyond insanity for imprisoning himself with Xerath. On the other hand,  Nasus might be the only remaining Ascended that can help the Emperor. Azir deeply respects Nasus, though the Curator looks down on him for his arrogance and for what his hubris did to Shurima.[1]",
    "positions": [
      "Mid"
    ]
  },
  {
    "champion": "Bard",
    "title": "Bard (Character)",
    "abilities": "Bard knows about and has met many Celestials on his travels around the cosmos. Unlike other Celestials however, Bard perceives the world in a completely unique way; as harmonious music rather than through sight. Along with that, Bard doesn't manifest in the physical realm through possessing a mortal body like the Aspects do, Bard instead possesses a collection of trinkets and instruments strewn together into a suitable form. Bard is aware of other Celestials and their affairs in meddling with  Runeterra, such as how they had left behind countless powerful artifacts on the planet, but he simply questions why they would leave these objects behind and endanger the universe. At the first breath of creation, Bard simply drifted across the cosmos without purpose or perception. It wasn't until Aurelion Sol forged the first stars that Bard began to perceive the universe as music, flowing across the harmonies between the stars and witnessing the beauty of the universe. Bard perceives the universe as musical melodies and first took notice to Runeterra because of its inherent dissonance in the universe's harmonies. Though the music of Runeterra is primitive and chaotic it is also beautiful in its freedom, something that specifically took Bard's interest. However, he also sees the danger of this as Runeterra has the capability of growing so chaotic and destructive that it could end the stability of the cosmos, dedicating himself to becoming the cosmic caretaker of this world and keeping incomprehensible powers out of mortal hands. Ever since touching down at  Ionia, Bard continues to passively restore the balance of powers in Runeterra rather than interfering in major historical events, having no direct ties to major events such as the arrival of the Watchers, the Fall of Shurima or the Ruination of Helia. Though these events involved powerful forces, they had no major cosmic ramifications and thus didn't take Bard's notice.[10] Though its unknown whether or not the two have actually met in the past, it is very likely considering Ryze's age and their conjoined efforts in safeguarding powerful magics such as the World Runes.",
    "positions": [
      "Support"
    ]
  },
  {
    "champion": "Bel'Veth",
    "title": "Bel'Veth (Character)",
    "abilities": "As a well versed huntress of the  Void, Kai'Sa is the natural enemy of Bel'Veth and aims to oppose everything she stands for. Bel'Veth however looks down at Kai'Sa, both with a form of admiration but also entertained by her foolishness in her attempts to stop her. Bel'Veth mostly admires Kai'Sa as she is one of the few individuals to retain their sanity after encountering the Void so much, with the only other individual being her own father  Kassadin. During their first encounter, Kai'Sa continuously attempted to attack Bel'Veth with no effect. Bel'Veth offered Kai'Sa a deal to find a way to stop her creators the Watchers from completely erasing reality and, in return, Bel'Veth will give humanity a period of time before being consumed by her Lavender Sea, seeing her success as inevitable whether or not Kai'Sa assists her.[6] Though it's unclear whether or not Bel'Veth has personally encountered Kassadin, she is very much aware of him as one of the few people to retain their sanity after facing the Void alongside Kai'Sa, who she is aware of as her father.[6] As Malzahar ventured through the lands of  Shurima in search of his true destiny, he stumbled upon the ruins of  Icathia and encountered the enigmatic powers of the Void. It's believed that he may have communicated with the Lavender Sea itself, suggesting that Bel'Veth was responsible for influencing his mind.[7] When the Lavender Sea desired a leader, it commanded Malzahar to find and gather enough minds to sacrifice to the Void so that it may birth one. This ultimately led him to open a rift in the city of Belveth, meaning he was the one responsible for her birth.[2] Bel'Veth considers Malzahar her prophet, using him to carry out her desires among mortals and rallying followers to reshape reality according to her own vision.[8] Because of Bel'Veth's unique nature, she fights with other Voidborn due to their unwillingness to join her cause. Despite this, she actually speaks in high regards to her fellow Voidborn especially if they display more intelligence that can somewhat match her own, seeing potential for them to join her and evolve past the need to serve the Watchers. Because of Vel'Koz's intelligence and continuous loyalty to the Watchers, he serves as a constant rival to Bel'Veth. She constantly taunts him for serving the Watchers to willingly, stating that they are incapable of seeing her vision of the Void. In turn, Vel'Koz may actually fear her in some regards.[9]",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Blitzcrank",
    "title": "Blitzcrank (Character)",
    "abilities": "Created in the service of  Zaun, Blitzcrank prides themself in protecting the citizens of Zaun from the chemical spill that dots the city's landscape. Far more efficient than their peers, they were able to clean up multiple spills without sustaining any damage that would have cause for repair. After a while Blitzcrank was learning beyond what their initial directives had set out for them. They started to innovate, interpreting and extrapolating on their daily directives. As a result, they did far more to serve the people of Zaun, and even began to interact with them on a regular basis. Viktor discovered a Golem, after it was abandoned because it was rendered inoperative. In a stroke of brilliance, Viktor implanted a Hextech crystal into the machine that would elevate it far beyond the original scope of its creation. After the machine rumbled to life, Viktor named his new creation Blitzcrank after the fizzing arcs of lightning that danced around their frame. It was an unexpected side effect of the hextech crystal. Viktor is protective over his creation. When it is threatened to be destroyed, he start planning how to get it to safety. Before he was able to enact this plan, the golem already left his facility. Ekko and Blitzcrank have fought chempunks together. Blitzcrank used to help  Zeri climb the Clocktower of  Piltover. She notes that their arm is no joke. At one point, Blitzcrank became badly damaged after a violent encounter with a couple of scrappers, causing the detachment of their arm. Luckily, Zeri was nearby to help save and repair them.[4]",
    "positions": [
      "Support"
    ]
  },
  {
    "champion": "Brand",
    "title": "Brand (Character)",
    "abilities": "Since he was young, Kegan was ostracized by the villagers of Rygann's Reach for being a son of a reaver and therefore being a symbol of bad luck in the village, insulting him with the moniker \"reaver-bastard\". Throughout Kegan's life the villagers subjected him to constant physical and verbal abuse, causing him to develop an aggressive and resentful personality. After his mother's death, he wished to take out his hatred towards the village for not grieving her death after she had overworked herself to death for their sake, though he blamed Rygann for stoking their beliefs in the first place. After the villagers witnessed his role in Zvanna's death, they mocked him again as he left the village. Even after going his separate ways, Kegan's bitterness from all of the torment his fellows subjected to him never faded, which allowed the World-Rune to tempt him into becoming Brand, leaving Kegan's personality as nothing but his resentment towards the world. Krezia is Kegan's mother, whom was also shunned and outcasted by the village. She wanted to resign herself and Kegan to their cruel treatment fearing that they would be exiled and left to die in the wilderness. Due to her paranoia, she tried to urge her son not to make things worse for the both of them, but he remained defiant and said he refused to be a coward like her. Despite her protectiveness towards her son, Krezia was also abusive towards Kegan due to him being a constant reminder of her husband and his crime which caused them both to be outcasts in the first place. Even so, Kegan grieved his mother's death and burned down Rygann's Reach to avenge her and the cruelty suffered by her alongside himself. Kegan first met Zvanna at the age of thirteen. She was the only person in the village who treated him kindly, so the two developed a friendship which later became a romance, though their relationship didn't last as Zvanna split up with him and later married Malvir, disappointing Kegan as he had lost the love of the only person who cared about him. Zvanna later told Kegan about Old Rygann's decree to exiled, feeling saddened towards him and offering him food to help him survive, though Kegan refused as he wanted to die in his exile. Later, Kegan's attempt to burn down the village ended up accidentally killing Zvanna and her family in the collateral damage, and he felt heavy remorse for causing her death. Old Rygann perpetuated his people's beliefs that the Rodhe family was bad luck, playing a role in the abuse they were subjected to. He wished to exile both Krezia and Kegan but only kept them due to the former's abilities to heal the villagers. Once Krezia died, Rygann had Kegan exiled as he no longer had worth for the village. Of all the people whom mistreated him, Kegan hated Rygann the most due to his role in Krezia's death, so Kegan came to his hut, threatening him with a knife while admonishing him for the way he treated him and his mother, before using his lantern to burn down Rygann's hut and by extent the entire village to get revenge. Brand was once a student of Ryze when he was still known as Kegan Rodhe. After Brand's transformation, they became enemies, with Brand intent on finding and gaining possession of another World Rune, which directly conflicts with Ryze's objective of making sure that nobody can find or use any other World Runes again.",
    "positions": [
      "Jungle",
      "Support",
      "Mid"
    ]
  },
  {
    "champion": "Braum",
    "title": "Braum (Character)",
    "abilities": "Braum's original tribe has a strong tie to  Ornn and hence his magic takes the shape of the ram.  Ornn is responsible for forging the door that would later be wielded by Braum. However, Braum is not aware of this fact. The  Frostguard is hostile toward Braum. Braum doesn’t hold any particular tribal allegiance with any tribe as he views all within the Freljord as brothers and sisters. However, he is particularly friendly toward  Ashe's and the  Avarosan, believing that Ashe may unite the Freljord. Braum stopped  Tryndamere's fury when he first arrived at the Rakelstake and may have introduced him to  Ashe. During his travels, he has encountered  Yuumi and  Book of Thresholds. Yuumi rested on his shoulders for a time, protecting him from angry snow-spirits stirring up flurries in a hailstorm, while he brought her wriggling fish. During the events of Ruined King, Braum joins  Ahri,  Yasuo,  Miss Fortune,  Illaoi and  Pyke to the  Shadow Isles to confront  Viego in order to protect  Bilgewater.",
    "positions": [
      "Support"
    ]
  },
  {
    "champion": "Briar",
    "title": "Briar (Character)",
    "abilities": "Briar was created by the Black Rose's hemomancers as a living weapon. After she proved to be too dangerous to keep unrestrained after her first mission failed, they bound her in a special pillory designed with a hemolith gemstone meant to keep her mind focused and under control. She was later deployed by the Black Rose to kill Jericho Swain during his coup, but lost control and was ultimately imprisoned by Swain and his guards. After Briar broke out of Swain's holding facility, the Black Rose continue to monitor and spy on her as she wanders the streets of Noxus, intrigued by her sudden development into a more sentient being. Briar was created with hemomancy, a magical art strongly tied to Vladimir, a founding member of the Black Rose. Though his exact relationship with Briar is unclear, it's heavily implied that he was mainly responsible for her creation. As her creator, Briar somewhat considers Vladimir her 'dad,' though she questions whether or not to actually call him that. The annotated sketch used for Briar splash art states that she is at Vladimir's castle, acting as a guard dog.[3] Whether this is true for the characters is unclear, however it does imply a possible relationship between the two after Briar escape. Boram Darkwill is the one who entrusted the Black Rose to create living weapons towards the end of his reign and mainly oversaw the creation of Briar as a perfect assassin. When the Black Rose deployed her to kill Jericho Swain during his coup, she failed and was captured by his guards, allowing Swain to eventually take over Noxus and kill Darkwill. Briar was sent to kill Swain during his coup but proved too difficult to control as she managed to kill everybody around her except for her target. As Swain managed to escape, his guards captured and restored Briar's pillory restraint, transporting her to a secret holding facility with several other living weapons sent to kill him by the Black Rose. Eventually, Briar managed to escape the facility, killing many of the guards and now roaming the streets of Noxus.",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Caitlyn",
    "title": "Caitlyn (Character)",
    "abilities": "Caitlyn earned her position as sheriff for her incredible use of firearms, especially in the rifle that is her favorite weapon, she never misses and Vi described her aim as impeccable. Caitlyn and  Vi are partners-in-law-enforcement. They have been working together for a long time so much that their relationship is speculated to be more than friendship and professional. They've been chasing after  Jinx who is Vi's sister and a dangerous criminal who's been wreaking havoc in Piltover. They managed to stop a turmoil caused by  Urgot and his followers, caught him and later put him in an isolated island prison. The duo later fight him again when his followers try to free him from his prison.",
    "positions": [
      "ADC"
    ]
  },
  {
    "champion": "Camille",
    "title": "Camille (Character)",
    "abilities": "She has encountered and fought against  Jhin during his assassination mission in Zaun which affected her clan's business. What happened to Camille afterward is still unknown, however.",
    "positions": [
      "Top",
      "Support"
    ]
  },
  {
    "champion": "Cassiopeia",
    "title": "Cassiopeia (Character)",
    "abilities": "Cassiopeia is  Katarina's younger sister. The sisters and  the Blade's Shadow are members of  Noxian noble house Du Couteau, whose head (General Marcus, Noxus' finest assassin) is missing and presumed dead. Cassiopeia was initiated into the  Black Rose order by her mother Soreana. One of her missions tasked by her mother was to retrieve godlike powers that had been the key to  Shurima's supremacy in ancient times to help the order defeat Swain's Trifarix. Her father and sister supported  Swain, which was considered a betrayal by Cassiopeia and her mother. Other members of her house may not be aware of their connection to the organization. Cassiopeia hired  Sivir to raid ancient  Shuriman ruins and later stabbed her to steal her blade in order to open an ancient tomb.\n Renekton and  Xerath were released thanks to Cassiopeia. ",
    "positions": [
      "Mid"
    ]
  },
  {
    "champion": "Cho'Gath",
    "title": "Cho'Gath (Character)",
    "abilities": "As a Voidborn, Cho'Gath is able to evolve and grow, becoming increasingly formidable. Some of its known abilities include: Cho'Gath has no known relations with any existing or known characters. ",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Corki",
    "title": "Corki (Character)",
    "abilities": "Corki is friend with  Lulu,  Teemo and  Tristana.  Graves captured  Teemo for the bounty on yordles while  Twisted Fate refuses because \"messing with Yordles brings a whole heap of trouble.\" He then fought Corki,  Lulu and  Tristana who came to save Teemo, which ended up in Graves being  turned into a frog and the Yordles escaping. ",
    "positions": [
      "Mid"
    ]
  },
  {
    "champion": "Darius",
    "title": "Darius (Character)",
    "abilities": "Darius was accoladed by Darkwill, but allied with  Swain because he sees in the Master Tactician someone who can make Noxus rise. In Darius' eyes  necromancy is cheating death to justify one's undeserved continued survival.[1] Yet for him,  Sion's legacy is an example. Though when he gazes upon the Undead Juggernaut, he sees what might become of himself should he no longer be useful to the empire (or rather, too useful, should death come knocking).[2] Darius holds no grudge against  Garen. However, he considers him a fool bound by a meaningless code of \"honor.\" Despite this, he would relish killing  Garen simply to prove  Noxian Might crushes all, even Demacian  Perseverance,  Courage, and  Justice—especially a paragon of said values.[3] Darius and his younger brother  Draven are renowned as the \"Blood Brothers.\" Family ties are strong and can serve as the basis for one's strength, yet Darius sees self-serving aristocrats using theirs as a crutch for their weakness, and as a result, the perpetuation of stagnant leadership that needs to be removed and replaced. With this in mind, one cannot tell if Darius providing and caring for  Draven during their childhood came out of love or even mere pragmatism. The comic Blood of Noxus seems to imply the former. He has 2 children (Decius and  Invetia Varn) mothered by his former lover,  Quilletta Varn. They never married given the pragmatism of Noxus, and knowing the likely trajectory of their lives at war.[4] She was murdered by their daughter  Invetia during the Battle of Basilich. While it was never explicitly confirmed that they are his children, it was heavily implied due to the relationship between Darius and Quilletta as well as some localizations using terms indicative of blood relation.",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Diana",
    "title": "Diana (Character)",
    "abilities": "Despite their disagreements,  Diana and  Leona were close friends and lovers growing up on Mount Targon. The two expressed romantic interest during a Festival of the Nightless Eve. Nami is travelling to Ionia to find Diana and request she conjure a Moonstone, a super-rare stone from a piece of the moon that broke off and embedded in the mountain aeons ago, to save the Marai from being overrun by the Voidborn invading the Guardian's Sea through a dimensional rift. Aphelios is looking for Diana to find out why she is running. Diana met a Celestial being descending from the Astral Grove. Soraka refers to Diana as the Pale-haired Woman/Sable-haired Girl Diana joined the Sentinels of Light to stop the threats of  resurrected Pantheon who was under the control of  Viego.",
    "positions": [
      "Jungle",
      "Mid"
    ]
  },
  {
    "champion": "Draven",
    "title": "Draven (Character)",
    "abilities": "Draven and  Darius are renowned as the 'Blood Brothers' (Draven being the younger one). Draven looked up to his older brother for guidance. They are competitive brothers, with both generally disapproving of the way the other goes about his life. Draven supported  Swain when he was considered a disgraced figure, and aided him in his coup for the leadership of Noxus. For this, Swain considers him a friend and ally. It is revealed in The Whispering Doodad that both  Draven and Warmason  Tamara Lautari harbor feelings towards each other that they refuse to express to one-another, much to the confusion of the observer. Draven had encountered both  Lulu and  Tristana, fought and fled from them during his return trip from Basilich to Noxus Prime. Draven sees  Riven as a mighty warrior worthy of his time in The Fleshing Arena. 2 Karl offered Draven an opportunity to renew the Reckoners' arena business, which he gladly accepted.",
    "positions": [
      "ADC"
    ]
  },
  {
    "champion": "Dr. Mundo",
    "title": "Dr. Mundo (Character)",
    "abilities": "Dr. Mundo fought against Ekko in the Sump level. However, he only perceived him as 'patient' in need of 'treatment', and it is unclear Mundo even remembers him.",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Ekko",
    "title": "Ekko (Character)",
    "abilities": "Ekko's parents work overtime in one of Zaun's many factories, so they're rarely home.[2] The graffiti Ekko often visits has paintings of girls with blue ( Jinx) and pink ( Vi) hair. Ekko and  Jinx were childhood friends and often played together. He had a crush on her before she started talking to  Fishbones and  Pow-Pow. Ekko and friends belong to a gang called the Lost Children of Zaun, a group of orphans and teenagers drawn together by their mutual interests and desire for community. Members of the Lost Children include: Ekko dislikes Pilties like  Jayce,  Ezreal, and  Caitlyn, as he sees them as arrogant and self-important, as well as to promote Zaunite nationalism. He is convinced Piltover is not the only progressive city in Valoran and is proud to be Zaunite. Seeing his former friends leave for the City of Progress gave him a bit of a chip on his shoulder. Not to mention his 12-year-old friend 4 Ajuna was killed by a Piltie.[3] However little by little Ekko began to stop judging the Piltovians, beginning to establish certain relationships or even to become familiar with them, like Camille and Seraphine. He finds  Ezreal a poser.[4]",
    "positions": [
      "Jungle",
      "Mid"
    ]
  },
  {
    "champion": "Elise",
    "title": "Elise (Character)",
    "abilities": "Elise is a member of the Black Rose that resides in Noxus for the most part. LeBlanc tasks her with bearing magical artifacts for her from Shadow Isles and gives her acolytes to offer to Vilemaw. She worships Vilemaw and its poison provides her with eternal youth in exchange for the acolytes as preys. She has multiple spiderlings living with her in the ruin of House Zaavan's halls. ",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Evelynn",
    "title": "Evelynn (Character)",
    "abilities": "Evelynn killed Vayne's mother and father, who were the patron and matron of House Vayne of  Demacia, in their home. Vayne came home while Evelynn killed them, and got a glimpse of her face. Vayne was scarred from this incident and dedicated her life to finding and destroying monsters, with her ultimate goal being to find Evelynn and take revenge for her mother and father. Like Tahm Kench, Evelynn is classified as a demon, and they seem to know each other. She considers him a rival, as both prey on humans and do not consider sharing her food, though their choices of victims are very different.",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Ezreal",
    "title": "Ezreal (Character)",
    "abilities": "Ezreal's parents were renown archaeologists of Piltover who, due to their expeditions and adventures outside of Piltover, would often leave Ezreal under the care of his uncle Professor Lymere. Despite their absences, they had a very clear love for their son and kept a good relationship with him on the short occasions that they'd return home to see him. Ezreal's father would often tell him of their many adventures in the form of stories that amazed the young boy, sparking his initial interest in adventuring and following in his parents' footsteps. Ezreal initially heard the story of Ne'Zuk from his father, who often described it as being his most ambitiously planned expedition as he joked to learn Ne'Zuk's teleportation magic so that he can instantly teleport back home after an adventure. Ezreal's mother was a talented navigator and the one who wrote meticulous field notes that Ezreal eventually used to help him navigate Shurima when he initially searched for the Tomb of Ne'Zuk. After their sudden disappearence, their fates remain unknown despite Ezreal's uncle believing that they most likely died on their adventure. However, Ezreal simply refuses to believe that and constantly copes with the idea that they'll eventually return. To this day, Ezreal continues to create a name for himself as a famous explorer with the intent of making sure his parents catch word of their son's grand feats, hopefully convincing them to return home finally. Professor Lymere is Ezreal's uncle and the one who primarily took care of him while growing up due to the absence of his parents. Due to Ezreal's troublesome nature as a child, the two had a rocky and tumultuous relationship. In order to occupy the boy and keep him from causing trouble, Professor Lymere enrolled him into college level courses, which proved ineffective due to Ezreal's incredible ability to absorb and retain knowledge. Freeing up his time from his uncle's classes, Ezreal would continue to cause mischief on the university campus, often angering Professor Lymere. To this day the two stay in touch and, despite their turbulent relationship, Ezreal seems to share some respect for his uncle as a professor. When Ezreal discovered Lymere's theories on Zaun's ancient history as a  Shuriman port city called Oshra Va'Zaun, he felt a bit of pity due to his lack of evidence and traversed the Vault of Resplendent Hollies to search for some to bring back, yet intended to take all the credit for himself.",
    "positions": [
      "ADC"
    ]
  },
  {
    "champion": "Fiddlesticks",
    "title": "Fiddlesticks (Character)",
    "abilities": "Though not directly equals, Fiddlesticks is still directly related to the other demons currently on Runeterra, such as  Evelynn,  Tahm Kench,  Nocturne and  Raum, the demon that  Swain is allied with. Along with this, Fiddlesticks's incomprehensibly ancient age may be the reason as to why it is the only champion to refer to  Kindred's original name, referring to them as the \"Grey man\". Zoe at some point took a key from Fiddlesticks. It is unknown what this key does, but one story as to Fiddlesticks's origins is a  Targonian legend that tells of how a child of twilight stole the only joy from a ragged, whispering horror.[4][5]",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Fiora",
    "title": "Fiora (Character)",
    "abilities": "(TBA) Jax might be the 'worthy opponent' Fiora longs for. He may also be interested in having her join his rebuilt Kohari. Fiora was set to marry a member of the Crownguard House but rejected it, leading to her father Sebastien having to participate in a death duel.\nTianna, Garen and Lux's aunt, selected a veteran warrior from the  Dauntless Vanguard to fight for her kinsman so that his defeat would be certain. As a result, she may have some resentment toward their family. Garen and Fiora know each other, as she helps train the Dauntless Vanguard, though they never train together as \"the outcome would be obvious\". They fought together against the dragon that attacked Ehrenmount. ",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Fizz",
    "title": "Fizz (Character)",
    "abilities": "Fizz is friend with many creatures of the shallow sea surrounding Serpent Isles such as 1 Shellshocker, 2 Coral Creatures, 3 Bubble Bear, 4 Zap Sprayfin and 4 Longtooth. Nautilus hates Fizz and would like to see him dead, though Fizz may not be fully aware of that fact.",
    "positions": [
      "Mid"
    ]
  },
  {
    "champion": "Galio",
    "title": "Galio (Character)",
    "abilities": "Galio was designed by Arcturus J. Durand, who also crafted Sylas shackles. Galio is the only instance of animated golem published by Durand. Galio fought  Vladimir and the  Noxian army at some point. As most Demacians do, the Crownguards make an annual pilgrimage to visit Galio on the Memorial Road. This is how he first became aware of  Lux, reacting to the growing presence of the light magic within her each year ever since she was a toddler. Galio sees Lux as the only mage he likes and has become a sort of guardian to her. Lux is apparently the first person to have an actual conversation with him. She was 13-years-old at the time.[1]",
    "positions": [
      "Mid",
      "Support"
    ]
  },
  {
    "champion": "Gangplank",
    "title": "Gangplank (Character)",
    "abilities": "(TBA) Gangplank and  Illaoi were in a relationship over a decade ago, but eventually broke up. After subjecting him to a  Test of Spirit in order to get him back 'in motion',  the Kraken Priestess ordered the Serpent Islander chiefs to support the Saltwater Scourge in retaking Bilgewater. They would lead Gangplank to Buhru artifacts that could control the Black Mist.  Illaoi was Gangplank's first love. She would eventually oppose him alongside  Ahri,  Braum,  Miss Fortune,  Pyke, and  Yasuo in Ruined King. Gangplank would enter a partnership with  Thresh in Ruined King, in order to awaken and subjugate  Viego to conquer Bilgewater. Viego's power would prove too strong for Gangplank and ended up controlling him instead. Swain and  Zed want Gangplank dead for stealing from each of them. Namely, Gangplank stole  Swain's personal warship known as the Leviathan and ransacked the Temple of the Jagged Knife belonging to  Zed's  Shadow Order. Miss Fortune managed to overthrow and 'kill' Gangplank in revenge for him murdering her mother back when she was a girl. Gangplank had only thought of  Miss Fortune as the most persistent of bounty hunters, unaware that she is the daughter of the gunsmith he killed when she refused to hand over  the twin pistols he had commissioned in order to spearhead his rise to Reaver King of Bilgewater. Miss Fortune would defeat Gangplank again in Ruined King and had him detained in order to publicly execute him as a show of power. He would escape before his execution and entered a massive gang war against Fortune.",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Garen",
    "title": "Garen (Character)",
    "abilities": "Garen is  Lux's older brother and their family name is Crownguard. He deeply respects and loves his sister, but he fears what may happen to her if her magical abilities were to be revealed. After the events of the Lux comic, Lux got Garen to verbally acknowledge that she was a mage. The two parted ways on good terms. In the end Garen ended up accepting his magician sister and that not all magicians are bad people. He and their aunt,  Tianna Crownguard, planned on arranging Lux to marry prince  Jarvan IV in order to protect her from persecution. As their family name implies, they serve and protect the crown. It is hinted that Garen and  Katarina have feelings for each other. Then there are those who imply it to the point of confirmation: Their special interactions with each other and various others in Legends of Runeterra suggests that at some point the two are in a romantic relationship, which they try to keep secret. Jarvan IV is Garen's childhood friend. When the Exemplar was captured, Garen felt responsible and led the Dauntless Vanguard on a rescue operation. Garen and  Taric are long-time friends from the Shield of Valoran's days in the Demacian military. Garen was furious at being convinced  Taric was wasting his talents as a warrior but he still believed in him. Garen and  Luxanna's father, Pieter Crownguard was a defender during the failed Noxian assault nicknamed Cyrus's Folly. This is likely referring to the same Cyrus who conquered the port city Basilich, which also happens to be the home town of  Darius and his  younger brother.",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Gnar",
    "title": "Gnar (Character)",
    "abilities": "",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Gragas",
    "title": "Gragas (Character)",
    "abilities": "Gragas is loosely allied with the  Avarosan for unknown reasons. He once blundered into a deteriorating negotiation between two tribes discussing an alliance with  Ashe. In his drunken stupor, he set off a brawl. When the participants of the fight finally came back to consciousness,  Ashe proposed a friendly drink as an alternative to fighting. With their tempers doused, the two tribes, formerly on the brink of war, bonded over a common love of Gragas' brew. ",
    "positions": [
      "Jungle",
      "Top",
      "Mid"
    ]
  },
  {
    "champion": "Graves",
    "title": "Graves (Character)",
    "abilities": "Their partnership started when they recognized a kindred soul in one another across a table during a high-stakes game in Mudtown. They both shared the same reckless passion for danger and adventure, which is what encouraged them to form their partnership. Graves being the brawn, and T.F. being the brains they were an unusually effective team from the outset. Their mutual sense of roguish honor grew into genuine trust, and together they hustled across Valoran. They were forced apart when a heist went south, with Graves getting sent to The Locker despite Twisted Fate’s efforts to save him. Graves endured years of torture and solitary confinement, during which time he nursed his bitter anger toward his old partner, and, convinced T.F. had betrayed him, Graves was determined to have his revenge. Graves reunited with T.F. again when MIss Fortune set them up, yet they were forced to put aside their differences in order to escape almost certain death in the ongoing conflict between her and Gangplank. Even though Graves and T.F. were tempted to reconcile their relationship, both knew it may take a while for Graves to completely trust T.F. again, still, the latter was happy to have his old friend back.",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Gwen",
    "title": "Gwen (Character)",
    "abilities": "Gwen was created by  Isolde,  Viego's wife. After being brought to life, Gwen uses Isolde's tools. Gwen also contains a fragment of Isolde's soul, like  Senna. Gwen travels across Runeterra to fight  Viego and the Mist as well as to help people in need. During the events of Rise of the Sentinels, Gwen accompanied the Sentinels of Light in the fight against the Black Mist and Viego. She worked as the team' hair stylist and tailor. Gwen and the 4 Ghostly Paramour seem to have memories of and feelings for each other, both say they've seen each other before but don't remember exactly when. 4 Ghostly Paramour is likely a reference to 6Viego; a perfect version of the imperfect man she once knew. ",
    "positions": [
      "Top",
      "Jungle"
    ]
  },
  {
    "champion": "Hecarim",
    "title": "Hecarim (Character)",
    "abilities": "Hecarim is a member of the Iron Order which vowed to protect  the king's land, but he does not respect Viego and only follows him as he allows to pillage lands. Hecarim is being hunted by  Kalista for his betrayal and for helping unleash the Ruination of the Blessed Isles, thus turning them into the Shadow Isles and its denizens into  Undead abominations. Hecarim faced  Miss Fortune and  Illaoi during one of the Black Mist's attack on  Bilgewater but was driven back when Illaoi channeled her god's power. ",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Heimerdinger",
    "title": "Heimerdinger (Character)",
    "abilities": "Heimerdinger is seen as a role model by  Ziggs and as a sellout by  Rumble. Ziggs used to work for him before the events of Paint the Town. Consequently, he knows  Jinx, who has stolen and used some of his experiments as \"target practice\".[1] Piltover recognizes Heimerdinger's contributions to technological advancement and techmaturgical (thaumaturgical and technological) research.",
    "positions": [
      "Support",
      "Top",
      "Mid"
    ]
  },
  {
    "champion": "Hwei",
    "title": "Hwei (Character)",
    "abilities": "Hwei's encounter with Khada Jhin was a pivotal turning point in his life. During Jhin's visit to Koyehn, the two exchanged creative perspectives, with Hwei guiding Jhin through the beauty of his home. There was a mutual respect for their differences, as Hwei recognized Jhin's virtuosity. However, the night before Jhin's departure, the dynamic shifted. Jhin, sensing the façade in Hwei's presented art, challenged him to reveal a genuine performance. Reluctantly, Hwei unleashed the true power of his art, revealing decades of suppressed emotions. Jhin, witnessing the forbidden visions, left with an inscrutable farewell. The consequences of that night echoed through Koyehn, leaving Hwei to grapple with the aftermath of tragedy. The encounter with Jhin left an indelible mark on Hwei's path, influencing the conflicting hues within him.",
    "positions": [
      "Mid",
      "Support"
    ]
  },
  {
    "champion": "Illaoi",
    "title": "Illaoi (Character)",
    "abilities": "Illaoi was Gangplank's first love.  Gangplank, but they went their separate ways over a decade ago. Their past relationship is implied by her liking mangos and him  oranges. Illaoi still has some feelings for him.She chose to save Gangplank after his ship was sunk by  Miss Fortune and gave him a spirit test which he passed. She then decided to help him retake the city. Illaoi protected  Miss Fortune and many others from an attack of the Black Mist, during which she drove off  Hecarim with the power of her god. Illaoi suspects  Miss Fortune needs to be tested by her god soon. This test is briefly shown in The Climb. Illaoi abhors the undead of the Shadow Isles and the Black Mist itself as both embody the very stagnation she seeks to eradicate. This can be illustrated when she tells  Sion he was 'cheated of rebirth' (his soul has been trapped and unable to reincarnate as new life)[1][2] The undead would fail their test instantly.[3] She would want to end  Mordekaiser the most for being the de facto puppeteer of others' souls.[4] Illaoi's dialogue with Braum implies that she finds Braum physically attractive. Over the course of the adventure, Braum and Illaoi develop a friendship. Illaoi would invite Braum to be more intimate and while he isn't averse to her advances, he declines because it is an inopportune time due to him needing to focus on the upcoming battles.",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Irelia",
    "title": "Irelia (Character)",
    "abilities": "Irelia cut off  Swain's arm which resulted in him contacting and taming a demon of secrets named Raum and then become the Grand General of Noxus, for such reason he is somewhat grateful for her action. Irelia was heavily antagonistic towards  Riven, due to her past actions during the Noxian Invasion, but grew to respect her during their time together as Sentinels of Light. Sona's in-game voice lines suggest she and Irelia met at some point when she returned to Ionia. The  Ionian resistance led by Irelia in the war was later sprung into different groups with different ideologies, including the Navori Brotherhood and the Navovi Militia. The Brotherhood in particular became more aggressive when she wasn't the hardcore leader they needed and has tried to kill her multiple times.[1] Irelia dislikes those with more pacifist attitude like  Karma and  Ivern or those who do not protect their homeland like the Kinkou Order since in her belief it would only lead to the fall of Ionia. She may also be willing to side with Ionian extremists like  Zed, his order and even the Navori Brotherhood if necessary despite not approving their method.[2] As told in  Legends of Runeterra, her resistance force include peasants of Ionia, musicians and dancers. Among those, Irelia appears to have the most intimate relationship with 5 Liana.",
    "positions": [
      "Top",
      "Mid"
    ]
  },
  {
    "champion": "Ivern",
    "title": "Ivern (Character)",
    "abilities": "",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Janna",
    "title": "Janna (Character)",
    "abilities": "Janna has been the protective deity of Zaun since ancient times. While worship of her has diminished during Darkin and Rune Wars, she would once again be called upon after the Sun Gates disaster. Since then Janna has been called upon to clear the air of noxious pollution from the undercity, as well as be a supportive presence for zaunite inhabitants that require it.",
    "positions": [
      "Support"
    ]
  },
  {
    "champion": "Jarvan IV",
    "title": "Jarvan IV (Character)",
    "abilities": "(TBA) Jarvan III is the father of  Jarvan IV and is the former King of Demacia. His lineage can be traced even further back to his great-grandfather of Jarvan I, the first king of  Demacia who was killed by  Sion during the decisive battle for  Noxus. Jarvan IV sees Xin Zhao as his Uncle. Sylas is looking to overthrow and kill the Demacian elite, including Jarvan. Jarvan IV was almost executed by  Sylas and now is chasing him, believing Sylas is behind his father's death, although the king was already dead by the time he was found. Jarvan IV and  Garen have known and become friends with each other since joining the military at young age. Jarvan IV was saved by  Shyvana after escaping and later helped her in slaying her mother and, out of gratitude, she earned a spot in the Demacian Elite Guard. Jarvan mentioned he loved someone that wasn't so different from the mages. It was later revealed to be Shyvana.",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Jax",
    "title": "Jax (Character)",
    "abilities": " Jax fought against the God-warriors of Shurima during the final days of Icathia. This would include  Aatrox,  Nasus, Renekton,  Varus, and possibly  Rhaast. While looking for people to join his rebuilt Kohari force, Jax stood on a bridge belonging to House Laurent, of which Fiora is a part of. After defeating numerous  Demacian warriors and fighters on the bridge, Jax fought Fiora. It is not known the outcome of this fight, however it is known that both survived the encounter.",
    "positions": [
      "Top",
      "Jungle"
    ]
  },
  {
    "champion": "Jayce",
    "title": "Jayce (Character)",
    "abilities": "Viktor and Jayce were previously friends, and are now unfortunately enemies. They disagree over many topics relating to ethics in science, most pertaining to free will.",
    "positions": [
      "Top",
      "Mid"
    ]
  },
  {
    "champion": "Jhin",
    "title": "Jhin (Character)",
    "abilities": "Akali tracked Jhin down to  Piltover- Zaun and was captured by him, but was later saved with the help of  Shen and  Zed. Even with their creative differences, the virtuoso could recognize that Hwei had been reluctant to push his own artistic potential in front of others. Jhin then encouraged the man to challenge himself, enabling Hwei to unleash decades of suppressed emotions within his art. As the main reason for his imprisonment, Jhin holds some resentment towards the Kinkou master. However, after Kusho fakes his death with the help of Zed and becoming the leader of the Navori Brotherhood, Kusho unleashed Jhin to terrorize and get control of  Ionia. Jhin knows the truth about the circumstance of Kusho's \"death\" and could have revealed to Shen if he had wanted to but didn't as he realized Zed was going after Kusho. Jhin has some resentment towards Shen and Zed for catching him and imprisoning him. During each of his encounters with both Shen and Zed, he would leave a trail of gruesome deaths behind him, which would forever change the two ninjas. After he was released, Jhin would force Zed and Shen to work together so he might kill them both for catching him years before. He attacked Zed, Kayn and their order, killing some of the members. Jhin has some interest in killing Sona for being a very famous  Ionian artist who is taking the spotlight away from his 'performances'.",
    "positions": [
      "ADC"
    ]
  },
  {
    "champion": "Jinx",
    "title": "Jinx (Character)",
    "abilities": "As an enforcer, Vi is dedicated to capturing Jinx at all costs. Jinx once painted a rude depiction of Vi on the wall of the Ecliptic Vaults, one of Piltover's most secure treasuries. Jinx seemingly shows no signs of knowing Ekko, despite Ekko stating that he knew Jinx and had a crush on her when they were kids. As the sheriff of  Piltover, Caitlyn is dedicated to arresting Jinx for her crimes. Meeting Ziggs during her regular escapades around Zaun, Jinx quickly saw through his yordle glamour, believing him to be a product of her imagination, more specifically, her conscience. Due to their shared love for explosions, Jinx convinced Ziggs to live with her in Zaun after a night of hijinks.",
    "positions": [
      "ADC"
    ]
  },
  {
    "champion": "Kai'Sa",
    "title": "Kai'Sa (Character)",
    "abilities": "Kaisa unwittingly released the sacrificial goats meant for  Malzahar's cultists into a Void-linked canyon as a prank to a transiting desert nomad, causing an earthquake that devastated her village, swallowing and killing all inhabitants except herself, who survived thanks to the symbiote suit and learning the Voidborns' methods of predation Kassadin lived in the same village as Kai'sa before the village was engulfed by The Void. The event killed Kassadin's wife and child, causing Kassadin to go on his quest for revenge against The Void. While is has not been confirmed, a prevailing theory among players is that Kai'sa is Kassadin's daughter. While their relationship in the main universe has not been formally confirmed, it has been implied through voice lines and in the  Four Beasts,  Riot Records, and  Star Guardian universes, Kassadin is  K/DA Kai'Sa's father.[1][2][3]  Bel'Veth reveals that Kai'Sa's father was the only other person to survive the Void, the only person being  Kassadin. Kai'Sa saved  Ezreal when he was attacked by Void creatures. Ezreal later helped her fight them. Kai'Sa encountered  Taliyah and her group on their journey to find Xolan, a mythical paradise in Sai Kahleek. They fought some void creatures together, including some of  Rek'Sai's Xer'Sai. Taliyah would then part way with the others and join Kai'Sa in going there. Bel'Veth is an enemy of Kai'Sa, Naturally feeling animosity towards the empress, Kai'Sa was shocked when Bel'Veth revealed she and her motives were more than a simple Voidborn's, talking about how she would be her salvation and even making a pragmatic deal to spare humanity so she would defeat the Watchers.",
    "positions": [
      "ADC"
    ]
  },
  {
    "champion": "Kalista",
    "title": "Kalista (Character)",
    "abilities": "Kalista is the  Ruined King's niece and was one of his generals in life. Kalista's father was the previous king of  Camavor. Viego became the king after his brother died in battle. Despite being her uncle, Kalista and Viego were around the same age and friends for a long time since he was largely ignored in favor of Kalista's father. When her father died and Viego became king, his negative traits were worsened and they began to drift apart, however she was still loyal to him. Kalista managed to protect Viego from an assassin, but resulted in Isolde getting poisoned instead. She would set sail in order to find a cure, but found it too late and was imprisoned as a traitor for her failure.She was eventually convinced by  Hecarim to lead  Viego and their army to the Blessed Isles for the Waters of Life. When the masters of the island refused to let them use the water, Viego ordered her to kill anyone who opposed them. Kalista refused and was stabbed by Hecarim before her forces clashed with the Iron Order. Commander Ledros was her lover in life and is trying to free her soul.  Thresh tried to persuade him to give up trying to free  Kalista and so far has succeeded at obtaining his silver pendant which Ledros may use to remind Kalista of her humanity, but Ledros instead has tried to end the curse of the Ruination himself. Hecarim and his Iron Order are now restlessly hunted and \"killed\" by her, but they always come back due to the Black Mist. Vladimir was soul-marked by Kalista but he was able to banish her with the help of a magical artifact. He was a prince of Camavor, and Viego and Kalista's distant relative who was centuries old by the time they were born. Kalista occasionally comes after  Tahm Kench; however, he is safe from her due to his contracts with the victims. In her journey to the Blessed Isles, Kalista crossed paths with  Ryze during his formative years. Initially, she found the young apprentice brimming with arrogance and entitlement, reminiscent of her uncle,  Viego. Their first encounter ended with Ryze's arm twisted, after which Ryze started to be far more respectful towards the Camavoran princess.",
    "positions": [
      "ADC"
    ]
  },
  {
    "champion": "Karma",
    "title": "Karma (Character)",
    "abilities": "",
    "positions": [
      "Mid",
      "Support",
      "Top"
    ]
  },
  {
    "champion": "Karthus",
    "title": "Karthus (Character)",
    "abilities": "Karthus was a tally-man of  Kindred and, he still wears the vestments and carries the staff, which he still etches every time he 'releases' a mortal soul from life. ",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Kassadin",
    "title": "Kassadin (Character)",
    "abilities": "",
    "positions": [
      "Mid"
    ]
  },
  {
    "champion": "Katarina",
    "title": "Katarina (Character)",
    "abilities": "In contrast to  Cassiopeia,  Talon is the adopted son of Marcus Du Couteau. In youth, Talon was tasked with a mission by Katarina's father: to eliminate her. However, Katarina miraculously survived Talon's attempt, emerging from the encounter with a distinct scar across her left eye. This encounter created an unexpected bond between them, as both had failed in their respective missions. After their encounter, he adopted a nonchalant demeanor towards Katarina, assuming the role of her composed younger brother. Behind this facade, however, he secretly conspired with his adopted father to overthrow  Jericho Swain, who had recently ascended to power. Talon nursed a deep-seated jealousy towards Katarina, who had been entrusted with the symbolic daggers of House Du Couteau, a clear indication of the rightful heir. Upon revealing his intentions, Katarina responded with unexpected empathy. She understood that Talon was merely a puppet, obediently carrying out her father's orders without question. The failed assassination attempt, rather than fostering animosity, prompted Katarina to reflect on her family dynamics. As she departed from Talon, she wished for him to break free from her father's control and forge his own destiny. However, with a resolute warning, she made it clear that if Talon remained shackled by her father's influence, she would be compelled to bring an end to him herself. Katarina interacts very little with her younger sister,  Cassiopeia, since both live in different worlds. While Katarina was taught by her father, pushing her to learn the way of the blade, Cassiopeia took after their politically brilliant mother. Katarina and her father,  Marcus Du Couteau, had a very strained relationship. According to Marcus, her daughter always seemed to fail him as an assassin. To him, she was to brash and killed with a sense of passion and not with a cold, mercilessness he believed was necessary for an assassin. Because of this he ordered a young Talon to kill his firstborn daughter. After multiple attempts on her life failed, she confronted her father. She told the general she had considered taking his head instead, but eventually decided—as much as she hated to admit it—that he had done the right thing in ordering her death. She had failed. Not just as an assassin, or as a daughter, but as a Noxian. She knew she had lost her father’s favor, and could never regain it. He would raise others in her place, simply to spite her. Still, she vowed to redeem herself, no matter the cost—to rededicate her talents to the empire, and to become the sinister weapon she always intended to be. After her father mysteriously disappeared in 993 AN, she starts taking orders from  Swain. Three years later, he reveals himself to her, saying that Swain is going to send her on a mission to  Demacia to die. After not only completing her mission successfully but coming out of it alive, she returns to  Noxus. Realising that her father is trying to kill Swain, she immediatly moved to stop him.",
    "positions": [
      "Mid"
    ]
  },
  {
    "champion": "Kayle",
    "title": "Kayle (Character)",
    "abilities": "Both Kayle and are twin siblings, Kayle being the older of the two. During their living in Demacia, they were Winged Protectors and saved countless lives. Despite their diffirences, they always tried to work together and serve their noble goal. Their relationship soured after the event that lead to the death of their father, and they have big conflict both in attitude towards justice and focusing on Celestial/Human parts of themselves, but deep down they still love each other since they still need each other. Mihira is Kayle's mother. She approves Kayle's noble ideals about justice and building better world for righteous, guiding her and caring about that she should not lose herself in her ambitions. Kayle extremely respects her mother, seeing her as the savior of the world and mentor. Mihira is biggest reason why Kayle has chosen the path of fighthing for justice and building a better world. Kayle and Morgana defeated Aatrox during his attack on ancient Demacia City that they protected back in the days when they were Winged Protectors. Aatrox and Kayle having radically clashing personalities and hate each other. Kayle considers Ryze as her old friend, as well as Ryze shows good attitude towards Kayle, but the details of their friendship are unknown. Kayle knows about Xolaani's existence and seems to fight her at least once. In Darkin Saga alternative scenario, she faces her once again, with different possible outcomes, including smiting of Xolaani or Xolaani's possessing the celestial body of Mihira. Sylas knows certain truths about the sisters and calls out their power during the events of Lux comics and Mageseeker.",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Kayn",
    "title": "Kayn (Character)",
    "abilities": "When Kayn was a child soldier, Zed saw the potential within him and recruited him to be a part of his order, feeding him and giving him a home. Kayn became Zed's favorite and most loyal disciple, trusting him enough to confide valuable information and hoping that Kayn would become the new leader of the Order of Shadow if something were to happen to him. Kayn refused to betray him when Kusho urged him to, because of how he saved him from a hopeless fate and gave him a new purpose in life. Despite his loyalty, Kayn's growing arrogance led him to believe that with Rhaast's power, he would even surpass Zed one day. Kayn sees his wieldership of Rhaast as being his destiny, risking the Darkin's corruption to unlock his true potential. While Rhaast tries to manipulate him into embracing violence, Kayn defies him just as easily. They both fight against each other over control of his body, with Kayn intending to fully overpower Rhaast and claim his power for himself. Kayn, along with Zed and other members of the Shadow Order, were attacked by Jhin. Kayn may have a crush on Akali. She knows Kayn and finds him hot but too crazy for her taste. Kusho manipulated Kayn into serving him and ordered him to kill Zed, but Kayn remained loyal to Zed due to the latter being his mentor whom gave him his new purpose in life. Royce sympathizes with Kayn due to them both growing up as child soldiers of Noxus, considering Kayn as a \"brother in blood\".",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Kennen",
    "title": "Kennen (Character)",
    "abilities": "Kennen,  Akali, and  Shen are members of the Kinkou Order. Like  Shen, his duty is to preserve balance in  Ionia. Kennen was one of  Akali's mentors, teaching her shuriken techniques, and emphasizing speed and agility over strength. He convinced her mother Mayym, the previous Fist of Shadow, to choose her as the successor. Kennen and  Akali assisted  Irelia alongside  Yasuo and  Karma in her resistance in a seaside village against the  Noxian army that includes  Sion. The Kinkou Order is at war with  Zed and his Shadow Order. Kennen is willing to forgive the Master of Shadows should he be willing to seek redemption.[1] Kennen is a friend of  Teemo.",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Kha'Zix",
    "title": "Kha'Zix (Character)",
    "abilities": "At some point,  Rengar as sent to bring back Kha'Zix's  head as a trophy, being the only way Rengar could truly regain honor and return to his people he got exiled from. They fought from sunset to sunrise. Finally, near death, they reluctantly separated.  Kha'Zix now  hungers most to conquer and consume Rengar, the one beast he considers his equal.",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Kindred",
    "title": "Kindred (Character)",
    "abilities": "Fiddlesticks an equally ancient entity, is one of the only champions to refer to Kindred prior to their split, calling out to Kindred as the Link▶️   \"Grey man...\" This would 'explain' why the Kindred are two halves of a whole and why one has what the other lacks (Lamb's cold reason, Wolf's hot instinct). Lamb and Wolf (or any other 2 forms of Kindred) consider each other the only friend. In Spirit Bonds, it was implied certain parts of the Grey Man still exist somewhere in the Spirit Realm. As a god of deaths, Kindred is related to all other representations of deaths in Runeterra. Legends say 2 Mask Mother created Kindred. While it's unknown how true the story is, both Lamb and Wolf call her their mother. In Finishing Soates, it is revealed once the  Kindred are forgotten (or should all things have died out),  Lamb and  Wolf will kill each other, while 6 The Etherfiend will take away what's left. Karthus After the tally-men of Kindred collected Karthus sisters' bodies, as was custom in the parts of Noxus where they lived, Karthus followed them, asking them questions along the way. The tally-men soon accepted Karthus into their ranks, first as a grave digger, then pyre builder, then a corpse collector. Eventually, Karthus worked in the temple of the tally-men, tending to the sick in their final moments. he still wears the vestments and carries the staff, which he still etches every time he 'releases' a mortal soul from life.",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Kled",
    "title": "Kled (Character)",
    "abilities": "Kled fought together with  Sion back when Sion still lived, but doesn't think much of the new undead abomination. Kled considers everyone (including himself, bizarrely) his rival and he sees Skaarl as his only friend.[1]",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Kog'Maw",
    "title": "Kog'Maw (Character)",
    "abilities": "The Watchers are the creators of all voidborn entities, including Kog'Maw,  Cho'Gath,  Kha'Zix,  Rek'Sai, and  Vel'Koz. All voidborn creatures are part of a collective whose goal is to learn more about Runeterra and prepare for the Watchers' return. Kog'maw is being drawn to  Malzahar by the Watchers. The reason for this is not known and it is unknown what will happen once Kog'Maw reaches him. At some point Tryndamere either interacted with Kog'Maw or at least knew of him, as he at some point referred to Kog'Maw, saying \"If that's just hungry, I don't want to see angry.\" ",
    "positions": [
      "ADC"
    ]
  },
  {
    "champion": "K'Sante",
    "title": "K'Sante (Character)",
    "abilities": "Tope and K'Sante trained and hunted together for years, becoming an extremely talented and inseparable duo of hunters. Eventually, the two confessed their love for one another and, after sharing their first kiss, grew into an official, romantic relationship. While hunting for the cobra-lion, K'Sante became more prideful of himself and often argued with Tope over their differing methods in hunting down the Baccai beast, eventually having a massive falling out and separating as lovers. K'Sante, having to hunt the beast alone, swallowed his pride and sought Tope's help once more, only to find out that he had moved back to Marrowmark. However, he had left behind his journal and his many studies on the beast, revealing to K'Sante his many plans and strategies to kill the cobra-lion, which ultimately proved effective in the end once he slew it. The two reunited years later when battling some zealous followers of the Ascended  Xerath, fighting alongside each other as Tope nursed K'Sante back to health at his nearby camp over two days. Once awake, the two shared a meal together and reminisced on each other's lives, with K'Sante revealing a massive celebration being held for him and Tope having his wedding to a new lover that same time. Tope tried to apologize for leaving K'Sante during the hunt for the cobra-lion, but K'Sante interjected and stated that he should be apologizing instead for how he let his pride get the best of him and how he mistreated Tope in their relationship. Despite their past, the two hold a deep friendship and appreciation for one another, as K'Sante is genuinely happy that Tope found true love in his future husband and Tope is happy for K'Sante's new honorary title as the Pride of Nazumah.[2] Historically, Nazumah is independent from the rule of the Shuriman emperor and denies any Ascended, seeing them as a threat. That said, K'Sante holds disdain for any of the Ascended, seeing them as one of the main threats he seeks to protect Nazumah from. With the growing conflict between  Azir and  Xerath, Nazumah is caught in the crossfire and K'Sante, as the Pride of Nazumah, fights against them and their followers. Nazumah rejects the rule of Azir as emperor and functions as a completely independent city-state. K'Sante has a disdain for Azir and his conquests over Shurima, seeing his rule as a threat to Nazuman culture. Though Xerath is responsible for atrocities against his people, such as the rampaging cobra-lion, he places blame on Azir as well for being the one that Xerath is fighting against. The infamous cobra-lion that K'Sante and his lover Tope hunted years ago was actually the product of failed experiments by Xerath, as he attempted to fuse Shuriman fauna together with Ascension magic using a makeshift Sun Disc of his own. Because of that, K'Sante holds an even deeper hatred for Xerath, seeing him as a massive threat against his people due to the atrocities he's already committed. K'Sante has battled many of Xerath's zealous followers already, most recently reuniting with his lover Tope to fight off a large band of them seeking to kill K'Sante and invade Nazumah.[2]",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "LeBlanc",
    "title": "LeBlanc (Character)",
    "abilities": "LeBlanc was forced to work for Mordekaiser, whose downfall she would later plan. To secure the The Immortal Bastion, she has designed battle plans against the revenant's eventual return. LeBlanc knows  Veigar, who was in Mordekaiser's inner circle.[1] LeBlanc is the Matron of the  Black Rose, whose members include  Cassiopeia,  Elise and  Vladimir. LeBlanc tasks  Elise with bearing magical artifacts for her from Shadow Isles and in exchange, she gives Elise acolytes to offer as sacrifices to Vilemaw. Sion was resurrected under the help of the Black Rose, likely at LeBlanc's command. LeBlanc assisted Boram Darkwill's rise to Grand Generalship, but when he refused to be Leblanc's puppet, she orchestrated a revealing of the Black Rose, manipulating  Jericho Swain into revealing the Black Rose and its members. She then staged a fake execution of herself.[2] However, in the later years of Darkwill's life, Leblanc seduced him to her will once again with the promise of extending his mortal lifespan.",
    "positions": [
      "Mid"
    ]
  },
  {
    "champion": "Lee Sin",
    "title": "Lee Sin (Character)",
    "abilities": "(TBA) Lee Sin is a friend of  Udyr who he met in the Freljord. With his help Lee Sin was able to repel Noxian invaders from his homeland, while Udyr was able to find peace and calmness with the help of the monks. While Lee Sin has relations with all of the  Shojin Order Dragon disciples, he has some deeper relations with 2 Ying Yue. Lee Sin has fought members of the Shadow Order, presumably because they defy the sacred balance of  Ionia. ",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Leona",
    "title": "Leona (Character)",
    "abilities": "Despite their disagreements,  Diana and  Leona were close friends and lovers growing up on Mount Targon, but have since became enemies after becoming Aspects. The two expressed romantic interest during the Festival of the Nightless Eve.\nLeona saw the moment Diana was imbued with the moon's power, she rushed to help before being imbued with the sun's power herself and made an Aspect. Atreus climbed Mount Targon to find the power of Aspects when Leona refused to destroy the trespassers that attacked his patrol. After he defeated  Aatrox and became the new Aspect of War, he opposes her and other Targonian Aspects.\nLeona would not move against the Barbarians because she knew  Aatrox was slaughtering them, which Atreus would only understand later on.[6] Soraka refers to Leona as \"Woman whose face burned like the sun\". As the champion of the Solari, Alune sees Leona as the Lunari's ultimate enemy. However, like most of the Lunari, she is not necessarily hostile towards Leona or the Solari.",
    "positions": [
      "Support"
    ]
  },
  {
    "champion": "Lillia",
    "title": "Lillia (Character)",
    "abilities": "Lillia's mother, the legendary Dreaming Tree, was directly spawned by the ancient God-Willow tree in Omikayalan. When Ivern, as a once human barbarian, cut down the God-Willow, he fused with it and became the legendary Green Father as he vowed to tend to and care for all nature and helped nurture many of the God-Willow's spawned seeds including Lillia's mother tree. Due to the fact that Ivern is essentially fused with the God-Willow and he took the effort to care for the Dreaming Tree, he's considered an ancestor or 'grandfather' figure to Lillia. Their relationship seems very warming, as Lillia states that Ivern sometimes considers her his \"favorite sprout.\" Though Lillia never directly interacted with Yasuo, it is implied that he could be the figure that fled into the Garden of Forgetting during her first ever encounter with humans. At some point, Yone met Lillia developed a fond friendship with her, possibly when the two arrived at Weh'le during the Spirit Blossom festival. Yone, considering Lillia as one of the kinder spirits compared to the many Azakana he faces, has vowed to protect her from any dangers, particularly demons.[2] It's unclear whether or not they have directly met, but Yone states that Nocturne is targeting Lillia and has vowed to stop him from ever crossing paths with her. It's very likely they are at least aware of one another though due to Nocturne's innate connection to nightmares.",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Lissandra",
    "title": "Lissandra (Character)",
    "abilities": "Lissandra and her two sisters, Avarosa and Serylda, were three Iceborn sisters who served the Frozen Watchers until the latter two decided to fight for independence. Lissandra is the youngest of the triplets.[1]At the final battle on the Bridge above the Howling Abyss, she sacrificed her two sisters. After the fall of the Watchers and the deaths of her two sisters, Lissandra tried to wipe out any historical records of them from the Freljord. She was unable to completely snuff out legends regarding Avarosa and Serylda which still lingered on to the modern day. Seeing a threat in the tales about her past, Lissandra secretly plots the kill any potential Avarosa and Serylda figureheads. Deep down, Lissandra still loves her sisters and one of the main reasons she has to removed their names from history is because it hurts her to remember them. She lost her sight to  Volibear during one of their confrontations in the early days of the Freljord and along with her Frostguard has been actively containing his worship as well as other old demigods' in order to weaken them, though he refuses to vanish and continues to actively expand his influence. Legend says the Three Sisters asked for  Ornn's help to build the Howling Abyss, though the tale may not be true. Lissandra is actively trying to contain the worship of  Anivia, sending out allied raiding parties to attack Notai carravans. At some point Anivia herself would battle against the Frostguard army. The Watchers would give Lissandra and her sisters true Iceborn powers. Lissandra was the 'Seeker', the intermediary between the Iceborn and the Watchers. Eventually, after learning about the Watchers true intent, her sisters would openly rebel against them, with Lissandra seemingly still allied with them. During the final day of the rebellion, the Watchers broke out and threatened to consume the world, Lissandra betrayed the Watchers and sealed them away under the Howling Abyss. At that battle she sacrificed many, including both Avarosa and Serylda. Lissandra and her Frostguard keep watch over the Howling Abyss in an attempt to prevent the release of the Watchers.",
    "positions": [
      "Mid"
    ]
  },
  {
    "champion": "Lucian",
    "title": "Lucian (Character)",
    "abilities": "Lucian and  Senna are husband and wife.  Lucian's father Urias saved Senna as a child and later helped her become a Sentinel. Senna met Lucian to deliver the news of his father's death. Love developed between them and they became husband and wife. She also helped him become a Sentinel.  Thresh killed 3 Senna when she tried to save Lucian. This event fueled Lucian's hatred for Thresh and  Shadow Isles. Lucian traveled to Bilgewater in pursuit of the Harrowing to locate Thresh. It was then he found out Senna's soul is trapped inside the Chain Warden's  lantern. Lucian continued to pursue the Mist to free her and finally succeeded, though he did not expect her to come back to life. Although Senna has been freed, Lucian remains obsessed with exacting vengeance from Thresh, as he is certain the Chain Warden’s machinations have only begun. During the events of Shadow and Fortune, Lucian and  Miss Fortune encountered each other in a recent  Bilgewater's Harrowing. They both fought the undead from the Shadow Isles and parted way in friendly terms. Despite this, she would eventually betray him and the Sentinels of Light to  Viego. She intended to persuade him to help her claim Bilgewater. They also encountered  Olaf in the same events but did not think much of him. Olaf would eventually forget that he met Lucian. After Senna was freed, the couple's main goal is now to stop  Viego and his Black Mist. Upon finding out about Senna's relation to Isolde, his wife, Viego chased her and Lucian and succeeded in retrieving Isolde in spite of their efforts to stop him. Gwen allied herself with Lucian and Senna to aid the Sentinels of Light and oppose Viego. Lucian and Senna recruited multiple Sentinels of Light to aid them against Viego, including:  Diana,  Graves,  Irelia,  Olaf,  Pyke,  Rengar,  Riven, and  Vayne. Lucian and a Rookie saved Rengar from some wraiths when they traveled to the jungles Ixtal in search of a fetter. Lucian snuck off to Shurima to find the Absolver and met  Akshan. While initially refusing to join their cause, Akshan would have a change of heart and revived Lucian after he was killed by wraiths.",
    "positions": [
      "ADC"
    ]
  },
  {
    "champion": "Lulu",
    "title": "Lulu (Character)",
    "abilities": "Lulu likes both  Poppy and  Tristana, but she sometime finds them too serious for her liking. Draven and  Tamara have encountered both Lulu and  Tristana, fought and fled from them during his return trip from Basilich to Noxus Prime. Graves captured  Teemo for the bounty on yordles while Twisted Fate refuses because \"messing with Yordles brings a whole heap of trouble.\"   Corki, Lulu and  Tristana fought  Graves when trying to save Teemo, which ended up in Graves being  turned into a frog and the Yordles escaping. In the old lore, Lulu is a friend of  Veigar. Their connection in the new lore is left unambiguous.",
    "positions": [
      "Support"
    ]
  },
  {
    "champion": "Lux",
    "title": "Lux (Character)",
    "abilities": "Lux is the youngest in noble family Crownguard, born with magical abilities she keeps hidden for fear of being executed or exiled from Demacia. Lux feared of what could happen if her older brother  Garen found out about her powers (their uncle was killed by a mage, an event that made Garen show magic users both zero tolerance and no mercy). She believed their mother was the only one who knew, however, she had no idea that Garen and their aunt  Tianna had realized that she was a mage several years earlier, and were thinking of ways to protect her. Although they are aware of her power, they were somewhat in denial of Lux being a mage herself. After the events of the Lux comic, Lux got Garen to verbally acknowledge that she was a mage. The two parted ways on good terms. Garen and Luxanna's father, Pieter Crownguard, was a defender during the failed Noxian assault nicknamed Cyrus's Folly. This is likely referring to the same Cyrus who conquered the port city Basilich, which also happens to be the hometown of  Darius and  Draven. Galio deems Lux 'the only mage he likes' (Link▶️   \"You. Young girl person. Can you stay and accompany me wherever I go?\") and the one that can help him attain prolonged animation periods longer than a single battle. Lux was apparently the first person to have a conversation with Galio when she was 13-years-old, but he first became aware of her when her family made a pilgrimage to see him when she was a toddler. During the events of Warriors, Lux would make an appearance during Sylas' attack with the Winter's Claw on a northern fortress, which Garen and his soldiers had retreated to. When things were going badly for the Demacians, she openly reveals her magical power to call for Galio's help, which rallied Garen and his men. Lux was introduced to the  Illuminators by Kahina,  Sona's adoptive sister. Lux met  Sylas when he's in prison. They developed certain bonds during their exchange, while Lux brought him food and books, Sylas taught her how to control her power. Later, Lux was manipulated and used by  Sylas to escape Demacian imprisonment after he learnt about the property of petricite thanks to her. Sylas genuinely cares about Lux, but will not hesitate to harm her if she stops in his way. Lux, in turn, is also ready to stop him if necessary. Lux was intended to marry  Jarvan IV Lightshield as suggested by her brother  Garen and her aunt  Tianna, in order to gain political immunity that would protect her of any controversial accusations that would otherwise damage her and her family's reputation in Demacia.",
    "positions": [
      "Mid",
      "Support"
    ]
  },
  {
    "champion": "Malphite",
    "title": "Malphite (Character)",
    "abilities": "Chip is literally a chip of Malphite's body. Their relationship is like that of a loving father and son. Malphite and Taliyah are friends. They play rock paper scissors, but Malphite always loses as he predictably always picks rock.",
    "positions": [
      "Top",
      "Mid",
      "Support"
    ]
  },
  {
    "champion": "Malzahar",
    "title": "Malzahar (Character)",
    "abilities": "Even though Malzahar (and  Kassadin) are both Shuriman their ties to the Void directs all their focus to the ancient city of Icathia and what lies within it. Malzahar might be attempting to make Icathia rise again just like  Azir did with the Ancient Shuriman capital. It is uncertain whether or not he is aware of the  rise  of  the  Ascended. Even if so, making way for the Voidborn takes precedence over a handful of actually mortal demigods that can be overrun by infinite hordes anyway. Malzahar in turn lured  Kog'Maw into Runeterra. It could be speculated the hivemind entity is the Mouth of the Abyss' 'Daddy', the 'Terror who is coming'. In short  Kog'Maw might be foreshadowing a cataclysm on an interdimensional scale so large the Rune Wars will seem a children's brawl in comparison. Bel'Veth is Malzahar's master, helping him in his goal to bring the  Void to  Runeterra in exchange for him providing her with sacrifices to assimilate. ",
    "positions": [
      "Mid"
    ]
  },
  {
    "champion": "Maokai",
    "title": "Maokai (Character)",
    "abilities": "",
    "positions": [
      "Support",
      "Jungle"
    ]
  },
  {
    "champion": "Master Yi",
    "title": "Master Yi (Character)",
    "abilities": "Yi was trained by Master  Doran. Master Yi has a close teacher- student relationship with  Wukong. As the last survivor of Wuju village, he taught Wukong the  Wuju Style to honor the legacy of his lost home (although the Monkey King uses a  staff rather than a sword). ",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Mel",
    "title": "Mel (Character)",
    "abilities": "A brutal Noxian warlord, she taught her daughter about the art of war from a very young age while still being Solari. However, while Ambessa approved of Mel's cunning and statecraft, Ambessa was disappointed by Mel's lack of cutthroat instincts. One of Mel's most traumatic childhood memories is when Ambessa let Mel decide the fate of the last scion of a recently conquered regime. Mel advocated that they let the conquered scion live in exile in order to show their new subjects that they are merciful, but Ambessa argued that they should show no mercy to their enemies lest they rise up against them again. Ultimately, Ambessa personally executed the scion in front of Mel to teach Mel the lesson. Eventually Ambessa would see that Mel's forgiving nature was a liability to her, so she banished her to Piltover. A strained relationship, Mel fears her mother while also resenting her for her past actions. She would eventually confront her about it, which would lead to Mel symbolically cutting ties with her Noxian roots. Kino Medarda is the brother of Mel. Kino was said to be gifted with a silver tongue and also believed that he could talk his way out of anything. She is told that he eventually crossed the wrong man and died for it. He used to tell Mel that \"War was a failure of statecraft\", which may have influenced Mel's preference for diplomacy. Which indicates that Kino was one of the few members of his family for whom Mel had a lot of love and affection. Mel respected Heimerdinger as the founder of Piltover. However, she saw his conservative and stifling ways to be a hindrance in her rise to power. She would undermine his authority by aiding Jayce and Viktor legalize the use of Hextech in Piltover, and later voting him out from the Council. While initially using Jayce to gain more wealth and prestige, Mel would eventually have some deeper feelings towards the inventor—even defending him from the self-serving influence of her ambitious mother. She would be concerned over his issues and would give him sound advice, all while still putting her own goals into consideration. Over time, Mel became less reserved around Jayce and began sharing personal details about herself as well. While Mel's relationship with Jayce started out as a means to an end, it ultimately became sincere love. Mel was crucial in Jayce's meteoric rise to fame: she even swayed the council to elevate Jayce and grant him a seat on the council. As the assistant of one of Piltover's Council, Elora handled many of Mel's communications with her business and political associates. Due to this and how closely together they work, Elora is made privvy to at least some of Mel's grander plans. She is also at least somewhat familiar with her origins.",
    "positions": [
      "Mid",
      "Support"
    ]
  },
  {
    "champion": "Milio",
    "title": "Milio (Character)",
    "abilities": "Milio has a great bond with all of his family members, ranging from his parents to his siblings as well as his many cousins, all of whom he grew up with in his home village outside of Ixaocan. They celebrated his accomplishment after he discovered an entirely new axiom when healing the wounded huntress. They made him the clothes that he would wear on his journey and continuously praise and encourage him. Milio speaks about his family very often, speaking highly of them and describing his extremely close and friendly relationship with each of them. He has seemingly befriended almost every member of his family, all of whom act as his driving force and motivate him to continue his journey. During his travels, he exchanged letters with his family to keep in touch with them, inquiring with them about their lives while he was away and often stating how he misses them and wants to make them proud. Lupé is Milio's grandmother and the one who initially tried training him in his elemental magic. Though she noticed his natural affinity for magic, Lupé actually stopped training Milio as he couldn't follow the traditional disciplines of the axiomata. Once Milio showed promise in the fire axiom, which she actively refused to teach him out of spite against her sister Luné, Lupé put her grudge aside and saw the potential in her grandson. Lupé helped prepare Milio for his journey to Ixaocan in order to showcase his natural abilities and restore honor to her family, creating his signature 'furnasita' and resuming his training. Milio very dearly loves his grandma, or 'omele,' and is strictly motivated in making her proud once he restores the family honor. He often mentions her on his travels, stating how proud she'd be to see him now. On top of that, he speaks very highly of his omele, describing her as very strong and similar in personality to  Nidalee, the fearsome Kashdaji queen he met on his travels.[1] Lupé is almost entirely focused on Milio's potential to restore the family's honor at Ixaocan, perhaps even disregarding her own family's feelings about it. Luné was imprisoned beneath Ixaocan before Milio was born, meaning she never got to meet her grand-nephew in person. However, after he gained fame across Ixtal as the 'boy with the soothing flames', she caught word of the stories about him and recently found out he made it into Ixaocan after his long journey. Milio's fuemigos serve as his main companions, as they are literal manifestations of his fire magic come to life. He carries a large one within his furnasita and often deploys smaller ones to heal and soothe wounds with their warmth.",
    "positions": [
      "Support"
    ]
  },
  {
    "champion": "Miss Fortune",
    "title": "Miss Fortune (Character)",
    "abilities": "Miss Fortune survived  Gangplank's murder attempt which killed her mother and plotted to avenge her mother's death. She hired  Twisted Fate to rob  Gangplank's warehouse while also tipping off  Graves about it. Both men acted as a massive distraction so that she could make final preparations to land the killing blow on  Gangplank. When they later returned to  Bilgewater in search of the Abyssal Crown, they angered a sea witch in the process. Miss Fortune, who had her quartermaster caught by the same witch, tricked and captured them both and then gave them to the witch in exchange for her quartermaster, but then helped T.F. and Graves escape.  Graves holds a grudge against Sarah but still thinks she is impressive. Between Burning Tides and Shadow and Fortune, Miss Fortune is purging  Bilgewater of all those loyal to  Gangplank after the power vacuum his 'death' caused (she is sure she can make Bilgewater prosper if the people are united under her banner). At one point before  Gangplank's 'death', him and Miss Fortune struck an uneasy truce in order to fight off the Harrowing, right on the shores of the Serpent Isles, in 'The Battle of Knife Straits'. They were successful (despite heavy casualties and their combined fleet scattering), while farther south  Nautilus managed to fight off the rest of the undead. During the events of Shadow and Fortune,  Lucian and Miss Fortune encountered each other in a recent  Bilgewater's Harrowing. They both fought the undead from the  Shadow Isles and parted way in friendly terms. She intended to persuade him to help her claim  Bilgewater. She encountered  Olaf but did not think much of him. Illaoi protected Miss Fortune from the Black Mist and  Hecarim. Unknown to Sarah, Illaoi secretly helped  Gangplank reclaim the city, while also intending to test her in the near future. During a shootout between Miss Fortune and a rival captain's crew,  Ryze got caught in their conflict and helped her out.",
    "positions": [
      "ADC"
    ]
  },
  {
    "champion": "Wukong",
    "title": "Wukong (Character)",
    "abilities": "(TBA) Wukong was trained in the Art of Wuju by  Master Yi. Wukong's original name was 'Kong'. When Kong agreed to become his student,  Master Yi dubbed him 'Wukong', effectively naming him after the Wuju style. Due to this, they share two similar quotes. Wukong and  Ahri are listed as related champions for unknown reason, possibly because of both being Vastaya. Ting was once a pupil of Wukong, but he was so overconfident in his own Wuju skills that Wukong sent him to  Master Yi to teach him humility.[1]",
    "positions": [
      "Jungle",
      "Top"
    ]
  },
  {
    "champion": "Mordekaiser",
    "title": "Mordekaiser (Character)",
    "abilities": "Given Sahn-Uzal (Mordekaiser when he was human)'s faith in the Hall of Bones, it's safe to say his culture did not have a  Kindred myth; which would explain why he was never claimed by them. Mordekaiser tortured  Veigar, who would later mimic him after his downfall. LeBlanc, another from his inner circle, was instrumental to his downfall. She is preparing to banish him when he returns to keep The Immortal Bastion for herself. Januk tasked  Ezreal to obtain The Elixir of Uloa with which he would be able to resurrect Mordekaiser. However, Ezreal intentionally gave him a fake vial and left Januk while stealing an old Ochnun bell. While it's not directly confirmed, it has been implied Mordekaiser may have a certain level of awareness about  Viego's actions and is waiting to benefit from them once he decides to return.[1] It has been confirmed if they were to directly fight, Mordekaiser would likely win.",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Morgana",
    "title": "Morgana (Character)",
    "abilities": "Both Morgana and Kayle are twin siblings, Kayle being the older of the two. Their relationship soured after the event that lead to the death of their father. Morgana chooses not to return to Demacia because she knows her sister would return as well.[1] Mihira is Morgana's mother. It is implied that Morgana does not love her mother, blaming her for causing her father pain and distress after becoming an Aspect. However deep down she still loves her and misses her but refuses to acknowledge it partly because of her pride. Aatrox and Morgana fought approximately a millenia ago. At the end of the battle, Aatrox was sealed within his blade. Nilah and Morgana met in the not-so-distant past. Whereas Morgana felt Nilah's pain, she found strange her everlasting jubilance. Sylas knows certain truths about the sisters and calls out their power during the events of Lux comics. Morgana aided Sylas in defeating the Mageseekers by revealing her true identity and giving him her blessing.",
    "positions": [
      "Support"
    ]
  },
  {
    "champion": "Naafiri",
    "title": "Naafiri (Character)",
    "abilities": "During the Darkin War, Naafiri fought against her fellow Darkin with the intent to become their leader. After her epiphany, she believed that strength in numbers could even apply to Darkin as their infighting only weakened them, so she strove to reunite with her fellow Darkin and show them her philosophy, so they could rule over Runeterra. Naafiri initially resented Myisha for imprisoning her, but since being enlightened by her new hosts she expresses thanks towards Myisha's successor  Zoe after her imprisonment led to Naafiri's own benefit. While imprisoned in the crypt, Naafiri's dagger was found by a raider whom she intended to make her host, but due to him knowing about the Darkin's assimilation abilities he took precautions to avoid making contact with her. Out of desperation, she called to the nearby pack of dune hounds to make the man slip so he would be able to touch her, but they ended up killing him and so she ended up assimilating the hounds instead. While Naafiri was being held by the raider, she noticed a nearby pack of dune hounds and influenced them to attack him so she would be freed. Once she ended up assimilating the pack instead in the scuffle, she initially felt disdain towards the hounds for their lack of hygiene and their need for companionship. But over time, she realized that the hounds' cooperation made them more powerful than an individual, which gave her an epiphany to unite the other Darkin in a similar way.",
    "positions": [
      "Mid"
    ]
  },
  {
    "champion": "Nami",
    "title": "Nami (Character)",
    "abilities": "Nami is in a bisexual polyamorous relationship with  Loto and  Tama.[1] Nami refers to  Loto as \"My heart\" and also refers to  Tama as \"My soul\".  Tama refers to Nami as \"Pele'ai\" means \"Beloved one\", a term of close endearment.  Loto refers to Nami as \"Beloved\". She is searching for the  Aspect of the Moon, which is the only one that can create the Moonstone her people need to survive. Nami refers to  Diana as \"Luminous Wanderer\", \"Child of the moon\" and \"Marai's light\". Nami is friends with  Fizz and is implied to personally know his pet shark 4 Longtooth Nami is currently the Tidecaller of the Marai tribe. She is the emissary of everyone in the tribe as  Tama, 4 Greatmother, 2 Ai'la, 3 Journeying Sandhopper,  Loto and 6 Leo'lei.",
    "positions": [
      "Support"
    ]
  },
  {
    "champion": "Nasus",
    "title": "Nasus (Character)",
    "abilities": "When the Shurima Empire still existed, Nasus fought alongside other Ascended hosts including those that would later become the Darkin. Nasus was a warrior scholar who spearheaded the military and cultural uprising of Ancient Shurima, but  Azir's  misled arrogance led to the empire's downfall, costing him his own brother  Renekton. Nasus was forced to imprison his own brother with the betrayer  Xerath, who would later drive Renekton into madness. After being freed, Renekton started to hunt down Nasus, believing he was the cause of all his suffering. Nasus hopes he can cure  Renekton of his madness, so that the united brothers might defeat  Xerath and restore Shurima to greatness together with their resurrected emperor  Azir. Nasus first sought  Sivir for her royal bloodline and finds in her the hope of a reborn Shurima and the key to defeating  Xerath. Nasus would later confront Xerath himself to buy time for her and  Taliyah to escape alongside other citizens. Nasus encountered  Taliyah when she was protecting an injured Sivir. Nasus would later confront Xerath himself to buy time for her and  Sivir to escape alongside other citizens. Myisha, the previous  Aspect of Twilight, led the Darkin Ta'anari to Nasus who guided them to the Chalicar, the blade that belonged to the Ascended queen Setaka and belongs to  Sivir in the present day, which Ta'anari later used to perform a ritual that reverted the Ascension of the nearby Darkins, vaporing them. Long before Shurima rose again from the sands,  Ryze and Nasus delved into a ruined archive beneath the Great Sai and fought its awakened protector. ",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Nautilus",
    "title": "Nautilus (Character)",
    "abilities": "(TBA) While the  Gangplank -  Miss Fortune combined armada fought the Black Mist on Bilgewater's shores (eventually succeeding but at great cost) Nautilus managed to stall and/or defeat the rest of the undead threat a few miles from the port city itself. Nautilus hates  Fizz and would like to see him dead.",
    "positions": [
      "Support"
    ]
  },
  {
    "champion": "Neeko",
    "title": "Neeko (Character)",
    "abilities": "Neeko has spent some time with Nidalee and her pack. Though Nidalee wouldn't aid her in her further quests, they parted on relatively positive terms. Neeko is in love with Nidalee, and while the romantic feelings were unreturned, their interpersonal relationship is beginning to blossom.[5][6] The two care for each other deeply and Neeko is perhaps the only person outside of her family whom Nidalee would risk her life for. Neeko mimicked Ezreal in the jungle during his search for The Elixir of Uloa.",
    "positions": [
      "Mid",
      "Support"
    ]
  },
  {
    "champion": "Nidalee",
    "title": "Nidalee (Character)",
    "abilities": "Nidalee was adopted by a pakaa packmother when she was abandoned as an infant in the jungles. Though her origins are an enigma, she was accepted by the pack as one of their own and she grew up deeply loving the other pakaa as her siblings, or kupakaa. After her mother was killed by a party of Kiilash hunters, Nidalee became the pakaa's new packmother, having vowed to protect her family and her home from outside invaders. Though Nidalee is unsure of what her true nature is, she knows that she has some connection to the vastaya, identifying as such whenever people ask what she is. When she first underwent a complete transformation, Nidalee inexplicably understood the natural vastayan language and retains her shapeshifting abilities from this heritage. A hunting party of Kiilash were responsible for the death of Nidalee's packmother, ultimately causing her first full transformation and allowing Nidalee to take up the mantle of packmother. The Kiilash, angered for their hunt being interrupted, cursed at Nidalee in their vastayan language before running away. Since then, Nidalee has developed a disdain towards the Kiilash, such as  Rengar, seeking vengeance for the death of her adoptive mother. When Neeko temporarily joined Nidalee's pack, the two became inseparable and formed an intensely loving friendship with one another. Nidalee gladly taught Neeko many survival skills and the two reveled in the many wondrous sights of the wilderness. When Neeko sought to fulfill her own journey, she urged Nidalee to follow but was unable to persuade her, causing them to depart as Neeko traveled outside of the jungles. When Neeko became freed from being captured by a band of Piltovan poachers, she reunited with Nidalee and the two ambushed the poachers under the cover of night. Neeko shared, and possibly still shares, immense romantic feelings towards Nidalee, but these feelings went largely unrequited for a while as Nidalee remains unsure of what her feelings truly mean. Though she's not sure what her relationship with Neeko could blossom into, she's absolutely certain that she deeply cares for Neeko exclusively in a way she has never felt for anyone else. With them reunited, new feelings are beginning to arise as the two share an even deeper bond.",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Nilah",
    "title": "Nilah (Character)",
    "abilities": "Nilah initially read stories about Viego's fall and the eventual collapse of  Camavor in books and myths. After Viego got imprisoned in Alovedra, his influence threatened Kathkan and drew Nilah's attention. She's more concerned with the implications of his ruination magic and how it affects demons, as Viego's ruinations causes them to go into mad frenzies and could potentially wake up the remaining primordial demons. Discovering Viego's imprisonment is what caused Nilah to travel westward in search of the legendary Sentinels of Light.[3] Nilah is on an quest to keep Viego from breaking free in order to save her homeland and stop his ruinations from reawakening the ten primordial demons. To do this, she needs the aid of the legendary Sentinels of Light, whom she only read about in stories. Nilah encountered Graves in Oyster Bill's Oyster Shack, tracking him down after asking around  Bilgewater for information regarding the Sentinels of Light. Her investigation lead her to Graves, who she fought in an attempt to get information and convince him to help her on her quest. Its revealed that the Sentinels of Light actually disbanded shortly after defeating Viego, as Graves already pawned off his Sentinel gear away. Nilah regards Graves as a friend and fellow hero of legend. Though its unclear whether or not Graves also regards Nilah as a friend, he has shown to be mostly freaked out by her, intimidated by the encounter but also intrigued as he sees her as a 'neat lady.'[3] Fiddlesticks is one of the ten primordial demons that Nilah is concerned with keeping asleep. It is the eldest sibling of Ashlesh, the same demon that Nilah encountered and keeps trapped within a jar on her hip. Though Nilah recognizes Fiddlesticks, as well as all of the primordial demons, as a threat to the world, she is supremely confident in her ability to fight them back utilizing the power of Ashlesh.[10] Oyster Bill is an oyster-man in Bilgewater who owns Oyster Bill's Oyster Shack. While gaining status as a famous sea-monster hunter in Bilgewater, she rented out a spare room in the shack and currently resides there. Oyster Bill often tells stories about Nilah and her amazing feats to the visitors of his shack, even allowing visitors to speak to her if they wish.[2]",
    "positions": [
      "ADC"
    ]
  },
  {
    "champion": "Nocturne",
    "title": "Nocturne (Character)",
    "abilities": "Nocturne terrorized the Demacian settlement of Fossbarrow until  Garen and  Lux expelled it from the neighboring tomb. It was sealed in the grave of their great-grandfather Fossian, who died during the fight versus Nocturne, before it was woken up by a mage boy named Luca. Sylas used to hear tales about Nocturne when he was young. During the Great Mage Rebellion, Sylas encountered Nocturne in the woods, disguising itself as  Morgana and admonishing him for the blood on his hands. Seeing through the demon's illusion, Sylas defeated Nocturne in battle, reverting to its true form and fading away. ",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Nunu & Willump",
    "title": "Nunu (Character)",
    "abilities": "Nunu heard many Freljordian legends and tales from his mother Layka, such as those regarding  Anivia,  Braum,  Lissandra,  Ornn, and  Volibear. Anivia is a spiritual guide to the Notai tribe from which Nunu hails from. Nunu has always seen Braum as something to aspire towards. If he ever met Braum, he would ask him to become his father.  Nunu was a refugee taken in by the  Frostguard after his tribe was attacked by raiders. He met  Lissandra, who told him about a beast. Nunu would later befriend this beast and call him  Willump. It is unknown if Nunu and Willump support  Ashe, but their deeds around the Freljord lead towards the same  Avarosan goals of peace and unification. ",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Olaf",
    "title": "Olaf (Character)",
    "abilities": "Looking for his warrior's death, Olaf fought the  Winter's Claw and defeated many of their warriors before fighting Sejuani. During the battle, Sejuani was able to convince him to join the Winter's Claw, and they now work together in order to accomplish Sejuani's goals of conquest and Olaf's goals of finally obtaining his warrior's death. Olaf along with the rest of the  Winter's Claw are on a mission to steal the Great Cauldron of  Ornn from Volibear and the Ursine in order to survive the oncoming winter, which is told to be the coldest winter in ages. While looking for a warrior's death in Bilgewater, a Harrowing commenced, prompting Olaf to fight the ghost of a Krakenwyrm that he had previously defeated. After being thrown away by the Krakenwyrm, Olaf traveled with  Lucian,  Miss Fortune, and their companions as they traveled towards the temple of  Nagakabouros, a temple headed by  Illaoi. While traveling, Olaf saw the undead Krakenwyrm and rushed to fight it again, abandoning the people he was traveling with. After almost being killed fighting  Vex, Olaf joined the Sentinels of Light (consisting of  Akshan,  Lucian,  Senna, and  Vayne) along with  Diana,  Graves,  Irelia,  Pyke,  Rengar, and  Riven in order to defeat  Viego, who had unleashed his Ruination onto the world. He guided the Sentinels through the Freljord and returned to his normal life after Viego had been defeated. Olaf is a naturally large man, described as being as tall as a mounted  Sejuani.",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Orianna",
    "title": "Orianna (Character)",
    "abilities": "TBA Corin Reveck is the father of Orianna. He saved Orianna's life by replacing her damaged organs with artificial hextech ones. Due to his heart starting to fail because of his aging body, Orianna sacrifices her heart to keep him alive.",
    "positions": [
      "Mid"
    ]
  },
  {
    "champion": "Ornn",
    "title": "Ornn (Character)",
    "abilities": "Many in the Freljord know of Ornn, yet few worship him or are considered his 'followers'. Once, an entire village of people known as the Hearthblood worshiped him and followed in his ways of forging and crafting weapons. However, the Hearthblood were all killed and their home destroyed during a battle between Ornn and  Volibear. Ornn has numerous demigod siblings, including  Anivia,  Volibear, and many others such as  Ildhaurg and the  Seal Sister. They were once all close, but soon grew apart due to their own ventures. In myths, it is said that Anivia once accidentally burned down Ornn's Horn Hall after trying to get back at him for felling her favorite perching trees in order to make it. Ornn did not know that it was her that did it and believed that it was his own arrogance that caused his home to burn down. He vowed to never again compliment his own work, which contributed to his stoic and quiet personality. Volibear and Ornn were once close, fighting in many battles together. However, as they drifted apart, Volibear grew jealous of the love that the Hearthblood freely gave to Ornn. Volibear and his followers went to Ornn seeking weapons and armor for battle. When Ornn refused, Volibear said that he would take what Ornn would not give, which caused Ornn to attack Volibear. Their fight lasted for eight days and neither of them perished. However, this fight killed the Hearthblood and Ornn has not been seen since. Legends say that Ornn dug out the Howling Abyss and built a bridge over it at the request of Lissandra and her two sisters, Serylda ( Sejuani's supposed ancestor) and Avarosa ( Ashe's supposed ancestor). How truthful the myths are is unknown. Lissandra and her  Frostguard have been trying to sabotage the worship of the old demi-gods, including Ornn, in order to deny them power and influence.",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Pantheon",
    "title": "Pantheon (Character)",
    "abilities": "Pylas was Atreus' childhood friend which he deeply respected. Both would climb Mount Targon after the Aspect of the Sun[1] denied their pleas to fight invading barbarians, with only Atreus surviving the climb. 3 Iula was the wife of Pylas. Inspired by the actions of her husband and Atreus, she would take up a spear and fight for the mortals of Targon against foes such as 6 Camphor. Years later, Iula would remind a broken Atreus of his purpose, reigniting his determination and warrior's spirit. Atreus would fight Leona while trying to reach the peak of Mount Targon. 5 The Pantheon is the Targonian Celestial Aspect of War, a being that (uncommon among Aspects) completely possessed the body of the current host, Atreus. After the death of the Aspect at the hands of  Aatrox, Atreus would be freed from the aspects control. He would breefly be controlled by a resurrected Aspect during the events of the Ruination. Atreus resents The Warrior for his arrogance towards mortals, an opinion that has shaped most of Atreus' viepoints towards god-like beings. He now prides in the power and resilience of mortals, and opposes the greater powers that threaten the world. Aatrox is instrumental in killing the Aspect that has shackled Atreus since his ascension. Atreus would survive this encounter (with a scar gowing down his chest as a constant reminder), later succeeded in his second fight against the Darkin Blade, reigniting the Aspect's power. Atreus inspired many mortals to fight in order to protect others, one of which is 1 Tor, a saga seeker that would eventually fight against a demon known as Camphor.",
    "positions": [
      "Top",
      "Support",
      "Jungle",
      "Mid"
    ]
  },
  {
    "champion": "Poppy",
    "title": "Poppy (Character)",
    "abilities": "Poppy's  hammer belonged to Demacia's founder and weaponsmith Orlon, who passed it on to her on his deathbed. She is searching for the 'Hero of Demacia' meant to wield the hammer (without realizing she is the one). When Orlon passed the hammer to Poppy, he did not specifically identify her as the Hero (or meant to, but died before he could), leading to Poppy's misunderstanding. Poppy and  Kled are notable for being Yordles responsible for helping in building the human civilizations they align themselves with (Demacia and Noxus, respectively). Poppy knows about the existence of  Lulu and  Tristana, though it is uncertain what she thinks about them. Lulu states that Poppy and Tristana has \"a little furrow just above her nose when she gets mad\". During a Black Mist attack by  Viego on a Demacian city,  Vayne and Poppy fought side by side against the undead army.",
    "positions": [
      "Top",
      "Jungle"
    ]
  },
  {
    "champion": "Pyke",
    "title": "Pyke (Character)",
    "abilities": "Miss Fortune and  Gangplank are both on Pyke's list, both being captains.[1] He would later hunt Miss Fortune during Rise of the Sentinels, when the Sentinels told her she was on his list. During the events of Ruined King,  Ahri,  Braum,  Illaoi,  Miss Fortune, Pyke and  Yasuo would set sail to the  Shadow Isles to fight  Viego in order to protect Bilgewater. Although Pyke is an undead, Illaoi sees Pyke as an eddy of a much deeper tide and therefore is in motion.[2] She subjects Pyke to Nagakabouros' test and her influence calms him from his murderous states. Later,  Pyke saved the Sentinels of Light from  Miss Fortune's attack after she made a deal with  Viego in exchange for power. Pyke then joined the team despite most of the members not approving it. Olaf wanted to fight  Pyke, thinking he could grant him a warrior's death, and said he cut his line.",
    "positions": [
      "Support"
    ]
  },
  {
    "champion": "Qiyana",
    "title": "Qiyana (Character)",
    "abilities": "Qiyana's parents neglected her due to her being the youngest of her 9 sisters, and thus furthest from the throne.[1] As a result of her parent's preferential treatment, Qiyana does not have a good relationship with her siblings. Inessa, the eldest daughter and 12 years Qiyana's senior, sought to humble her by besting her in ritual combat, but was instead defeated and crippled. Mara, the youngest of Qiyana's elder sisters, conceded her prefectship over Tikras after Qiyana exposed the hidden paths between villages in Ixtal. The Piltovan raid that followed killed about half the populace, and nearly Mara herself. Unbeknownst to Mara, Qiyana planned the entire ordeal in order to take over as prefect, amassing additional power and support from Ixtal citizens.",
    "positions": [
      "Mid"
    ]
  },
  {
    "champion": "Quinn",
    "title": "Quinn (Character)",
    "abilities": "Quinn's twin brother Caleb died while defending Barrett Buvelle, the adoptive father of  Sona, from a tuskvore attack. After his death, Lestara Buvelle petitioned to  Tianna Crownguard to let Quinn become a ranger-knight. Quinn is the leader of the  Demacian Rangers, whose known members include 6 Genevieve Elmheart and her 5 greathorn named Cern , the Yordle 4 Betrand and 3 his badgerbear Beemer, the 3 Greenfang Warden Dalin and his dog Rigby. She's receives her orders from High Marshal  Tianna Crownguard and carries them out dutifully. She has worked with  Garen and the  Dauntless Vanguard on their expedition to the Nockmirch. Quinn and Garen like and respect each other. ",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Rakan",
    "title": "Rakan (Character)",
    "abilities": "Rakan is a Lhotlan Vastayan who travels Ionia as a wandering entertainer. After meeting and getting in a relationship with  Xayah, both travel Ionia to preserve Ionia's natural magic from being controlled by humans. They are not married, since  Xayah wants to hear him proposing to her everyday. Rakan and  Xayah fought  Zed and his Order of the Shadow in Wild Magic to prevent them from harvesting a magical grove for the Kashuri Armories, the creators of  Jhin's  Whisper.",
    "positions": [
      "Support"
    ]
  },
  {
    "champion": "Rammus",
    "title": "Rammus (Character)",
    "abilities": "Rammus has no relationships with other characters ",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Rek'Sai",
    "title": "Rek'Sai (Character)",
    "abilities": "",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Rell",
    "title": "Rell (Character)",
    "abilities": "The Black Rose were the organization that initially took Rell in to the Roseguard Academy under the guise of training her to be an elite in Noxus's army. However, Rell eventually realized the horrific truth of their experiments on her and the other classmates in the academy, such as their experimentation with sigil magic that turned most of Rell's classmates into the Null. Rell has a deep hatred towards the Black Rose, and all of Noxus for that matter, because of what they did to her and her classmates within the academy. Now, as she rides across Noxus, she hunts down any remaining faculty that survived her escape and is set on brutally killing any of the Black Rose she manages to find. In response, the Black Rose have made many efforts to try and detain Rell, sending all manners of  bounty hunters to capture her for their plans in stopping the menacing  Mordekaiser. LeBlanc is the one who initially took notice to Rell's particular mastery with metal magic. After visiting Rell's parents, she offered a deal with them to take Rell into the academy and train her to be the Black Rose's living weapon, promising to make Rell an elite in the Noxian army and granting their noble house more political power in Noxus. Though she hasn't personally encountered Rell since her escape, she is most likely responsible for the many efforts to detain her. Rell's father was a Noxian footsoldier while her mother was the heiress to a noble house that has since fallen from grace. Though technically nobles, Rell's family didn't enjoy the lavish lives that other members of the Noxian nobility would have due to their lowered political power, causing Rell to often be frustrated. Once she showed her magical talent in ferromancy, Rell's parents instantly saw an opportunity to return their noble house to greatness and convinced Rell to try and hone her magical abilities and eventually become an elite within the Noxian army. Though most of their apprenticeships failed, LeBlanc approached the couple and offered a deal to take her under the Black Rose academy, turning Rell into a living super weapon and in exchange granting their noble house more power. While Rell trained in the academy, her parents would seldom visit her but would always express how proud they were of their daughter despite the brutal treatment Rell faced while training in the academy. Once Rell escaped on her sixteenth birthday, she discovered that the horrific experiments with the Null and sigil magic had been the orders of her own mother, who had been the headmistress of the academy this entire time. Now, Rell has a vicious hatred for her parents, but most particularly her mother, as she often mocks her mother's saying-\"excellence is measured in sacrifice.\"",
    "positions": [
      "Support"
    ]
  },
  {
    "champion": "Renata Glasc",
    "title": "Renata Glasc (Character)",
    "abilities": "Renata held a grudge towards her parents for leaving the family in poverty when she was young. After they died, she looked down on her parents' methods of charity and dedicated herself to becoming successful to prove them wrong. However, underneath she still genuinely loves her parents and laments their deaths, wanting revenge on the ones which were involved. Camille was among the Piltovan nobles responsible for the deaths of Renata's parents in 967 AN. After being expelled from the University of Piltover and returning back to Zaun, Renata would be responsible for funding Viktor's augment research. Ekko's parents, Wyeth and Inna, were forced to work in terrible working conditions under Renata's orders. Renata funded the gunsmiths responsible for selling Samira her guns. Renata with her cunning was able to turn Chem-Baron Spindlaw to her side to do her dirty work.",
    "positions": [
      "Support"
    ]
  },
  {
    "champion": "Renekton",
    "title": "Renekton (Character)",
    "abilities": "Nasus is the older brother of Renekton and became Ascended at the same time as him. While Nasus planned the battles, Renekton was the one to win the battles. When Xerath forced his Ascension, both Renekton and Nasus went to stop him and were the only two God-Warriors there. After a fierce battle, Renekton ordered Nasus to close the Tomb of the Emperors. Renekton respects Azir and willingly serves him. Azir hopes that it would help him remember what he had forgotten. Renekton also trained Azir in the ways of combat. Renekton spent eons battling Xerath within the tomb of the emporers. During this time, Xerath manipulated his slowing breaking mind to make him hate Nasus. Saikhal, Xerath's birthplace, was conquered by Renekton. Xerath was likely taken as a child slave at that time. Sivir's interference allowed Renekton to escape the Tomb of the Emperors. Aatrox, Varus, Rhaast, Xolaani, Anaakca, baalkux, horazi, ibaaros, Joraal,  Naafiri, Naganeka, Praa, Styraatu, and Tarrosh were all part of Host of God-Warriors, and all served  Shurima together with Renekton. ",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Rengar",
    "title": "Rengar (Character)",
    "abilities": "Having fought and lost an eye as well as almost his life, Rengar sees  Kha'Zix as the ultimate prey and wants to hunt him down and mount  his head on his den as the ultimate  hunting trophy. Rengar was saved by  Lucian and a Sentinel Rookie when the  Sentinels of Light came to the jungles Ixtal in search of a fetter, he would later join them in order to hunt  Viego to prove that he was still an apex predator.",
    "positions": [
      "Jungle",
      "Top"
    ]
  },
  {
    "champion": "Riven",
    "title": "Riven (Character)",
    "abilities": "",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Rumble",
    "title": "Rumble (Character)",
    "abilities": "Rumble is a resourceful yordle mechanic who is convinced Bandle City can be (if not is already) more technologically advanced than human nations (especially Piltover, where  Heimerdinger 'sold out') To prove that he is more technologically advanced than human nations, he built himself a mechanized suit from junkyard scrap (named  Tristy after the one he has a crush on). ",
    "positions": [
      "Top",
      "Mid"
    ]
  },
  {
    "champion": "Ryze",
    "title": "Ryze (Character)",
    "abilities": "Kegan Rodhe, as he was known before he became Brand, was previously Ryze's apprentice, saved by Ryze from freezing to death in the harsh  Freljordian cold. Ryze saw potential in Kegan and attempted to teach him to control his latent magical abilites. Kegan and Ryze both often became frustrated with eachother, but still held compassion for eachother. Though as Ryze neared the true goal of his journey, to one of the World Runes, Kegan fell to the temptation of the World Rune and Ryze was too late to stop him. Kegan's body and soul was burned away by the World Rune's power and what was left was the entity known as Brand. Brand now hunts down further World Runes and is constantly at odds with Ryze on his mission. Eventually, Ryze and Brand would meet in Shurima in the City of Gardens, in search of another World Rune, where Ryze would trap Brand beneath the sands, where he remains for now. Tyrus was Ryze's old master, member of a secret order tasked with storing and protecting the most dangerous of artifacts across Runeterra. Tyrus would later fall into the temptation of the World Runes, and Ryze was forced to kill him. Long before Shurima rose again from the sands, Ryze and the Ascended scholar Nasus delved into the ruined World Rune Archives beneath the Great Sai in search of a World Rune. During a shootout between Miss Fortune and a rival captain’s crew, Ryze got caught in their conflict and helped her out. Sona traveled with Ryze to the Hirana Monastery in  Ionia after the Noxian invasion and together fought the Navori Brotherhood who ambushed them.",
    "positions": [
      "Mid"
    ]
  },
  {
    "champion": "Samira",
    "title": "Samira (Character)",
    "abilities": "Samira performed in street performances alongside her parents when she was young. While she enjoyed performing, they wished her to live a more stable life. When her family immigrated to Noxus, she had to support her injured parents by herself but struggled to make ends meet. After becoming a mercenary, Samira told her parents about her tattoos and impressive feats. Samira is close to her mother, recalling the stories and advice she gave her when she was young. Samira was forced to evacuate Amakra after it was attacked by Xerath's followers, and harbors a resentment towards him for his followers' destruction of her hometown. Indari was impressed with Samira's bravery and commissioned her to be part of her own private warband. When Indari was caught in an explosion that severely wounded her, Samira risked her life to rescue her at the cost of her own eye. Despite Indari's shame towards her own failure, Samira knew that she understood her desire for thrills more than anybody and proposed to work with her again. Indari now supports Samira behind the scenes by providing her with mercenary work and takes pride in Samira's and determination though she can get frustrated at her recklessness causing trouble, though she has actually been conspiring with  LeBlanc without Samira's knowledge. Samira obtained her guns from Lani and Miel, two Noxian gunsmiths. LeBlanc sees Samira as an important factor in her plans to take over Noxus, so she indirectly manipulates Samira through Indari into carrying out her missions to benefit her own goals. Samira was unknowingly sent to find Rell under LeBlanc's instruction, by proxy of Indari.",
    "positions": [
      "ADC"
    ]
  },
  {
    "champion": "Sejuani",
    "title": "Sejuani (Character)",
    "abilities": "Sejuani and Ashe were once childhood friends but were seperated when Ashe's mother offended Sejuani's grandmother, Heijan, over how she was raising Sejuani. Years later, Sejuani found Ashe starving in  Ursine lands after the  Frostguard annihilated the rest of her tribe. Sejuani and Ashe became battlesisters the next day, but had a falling out during a raid against the Ebrataal Tribe, a raid which Ashe did not approve of. Sejuani now considers Ashe and her new tribe an enemy to the Winters Claw and a traitor to the Spirit of the Freljord. She views her peacekeeping and agricultural ways as a complete betrayl to Grena, Ashes mother who Sejuani respected, and to her legacy. Sejuani's loyal Drüvask steed who was freed from a Noxian warship during a raid by the Winters Claw and named by Sejuani after the texture of its hide. Even in the most tense of situations, grooming Bristle's hair always seems to calms Sejuani down. Udyr has been Sejuani's father figure in her actual father's absence. Even through his strange behavior, Sejuani has a deep rooted respect for him and his struggles, and will not tolerate any disrespect towards him. When Sejuani became warmother, Udyr acted as a trusted advisor for the new warmother. Sejuani has worked togheter with the Ursine in the past, performing an summoning ritual with the help of Udyr. Sejuani considered the Ursine kin of the Winter's Claw, matching eachothers with their savagery, though she still has a deep rooted fear for the Volibear and his corruption. Recently Sejuani has set off on a expedition into Ursine terratory to steal Ornn's Cauldron, originally stolen by the Ursine, in hope it would feed her people. Sejuani views the Frostguard in a very negative light, seeing them as nothing more than a slow poison, destroying the Freljord.",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Senna",
    "title": "Senna (Character)",
    "abilities": "Senna met  Lucian to deliver the news of his father's death and traveled with him to take part in Urias' parting vigil. The two would eventually fall in love and she would train him to become a Sentinel of Light. Due to her connection to the Black Mist, Senna was aware of  Thresh and his torture before eventually meeting him. He claimed her soul when she tried to save Lucian. Lucian traveled to Bilgewater in pursuit of the Harrowing to locate Thresh. It was then he found out Senna's soul is trapped inside the Chain Warden's  lantern. Lucian continued to pursue the Mist to free her and finally succeeded, though he did not expect her to come back to life. After the events of Rise of the Sentinels, Lucian and Senna continue their quest to stop  Thresh, now that he is unbound from the Shadow Isles. After Senna was freed, the couple's main goal was to stop  Viego and the Black Mist.  Viego fought  Lucian and  Senna to reclaim the fragment  Isolde's soul within her, and partially removed. Gwen allied herself with Lucian and Senna to aid the Sentinels of Light and oppose Viego. Both her and Gwen contain fragments of  Isolde's soul. Lucian and Senna recruited multiple Sentinels of Light to aid them against Viego, including:  Diana,  Graves,  Irelia,  Olaf,  Pyke,  Rengar,  Riven, and  Vayne. Senna disapproves of  Akshan's multiple Sentinel code violations.",
    "positions": [
      "ADC",
      "Support"
    ]
  },
  {
    "champion": "Seraphine",
    "title": "Seraphine (Character)",
    "abilities": "Seraphine understands the brackerns' singing language to an extent thanks to her magical hearing, therefore she comprehends the song from the hextech crystal in her platform. She'd probably be the only human able to communicate well with  Skarner. However, she does not know that they seek help, and they do enjoy her songs of togetherness. Caitlyn is an adoring fan of Seraphine's singing performance. Acorn is Seraphine's pet squirrel whom often acts as her companion. Acorn is believed by Seraphine's fans to be the heart of her idol operation, but in truth he is often disobedient and uncontrollable, to her annoyance. Being an acoustician, Seraphine's father gave her a hextech device to dampen her acute magical hearing. Proud of Seraphine's idol career, he supports her performances even if she withholds details from him and even allowed her to perform in the Undercity. Millie is one of Seraphine's biggest fans and the leader of her fan club. While she is too shy to engage in conversation before leaving, Seraphine still enjoys talking with Millie. Scratch has a friendly rivalry towards Seraphine, with both having enjoyment performing together. Judging by her flustered reaction when Acoustician tells her Seraphine talks about her a lot, Scratch's feelings toward Seraphine may be greater than just simple friendship.",
    "positions": [
      "ADC",
      "Support"
    ]
  },
  {
    "champion": "Sett",
    "title": "Sett (Character)",
    "abilities": "Sett loves his mother more than anything and dedicates all of his goals to supporting her and making her proud of him, to repay her for raising him in the past. He gives her gifts and money that he earned from his illegal activities while lying to keep them secret from her, though he feels guilty for doing so. Even while away from her, Sett tends to display affection towards his mother in private, and gets angered when someone makes fun of her. Sett barely knew his father due to him leaving the family when he was still a child, so he was curious to meet him. When he found out that his father had abandoned his family to seek fortune in other parts of the world, he grew to hate his father and aspired to fight against him one day. Though not confirmed, 8 The Old Timer is implied to be Sett's father, due to having a personal rivalry towards Sett and knowing many details about his past.",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Shaco",
    "title": "Shaco (Character)",
    "abilities": "Shaco has no known relations with any existing or known characters.",
    "positions": [
      "Jungle",
      "Support"
    ]
  },
  {
    "champion": "Shen",
    "title": "Shen (Character)",
    "abilities": "Shen leads the surviving Kinkou which has a great conflict of interest with  Zed's Order of Shadow and its defiance of Ionia's sacred balance.  Kennen remains by his side while  Akali went rogue. She and  Shen parted on neutral terms. Neither hates the other but both disapprove of the other's methods.[1] After  Akali and  Zed made their choice, Shen is starting to doubt whether the old way still works. Shen and  Zed are childhood friends and used to consider each other as brother before  Zed \"murdered\" Master Kusho. Master Kusho, Shen, and Zed were responsible for capturing and imprisoning  Khada Jhin, but were traumatised by the Golden Demon's actions in the process. Later on, when Jhin was set free again, Zed sought out Shen in order to inform him about Jhin's reappearance and to team up with him to stop him. Shen, despite still wishing to avenge his father's death, accepted the truce for the greater good. The duo later saved a captured  Akali from  Jhin and caught him. Shen is torn between killing Zed to avenge his father Kusho (the Kinkou's previous master and wielder of the  spirit blade) and enforcing equilibrium with the spirit realm (his duty takes priority, but he won't hesitate if given the chance). Zed could have revealed the truth about Kusho to Shen but then decided it was better for Shen to be disillusioned with Zed than to be disillusioned with his own father. That's probably not fair, and maybe Shen has a right to know. But Zed is flawed... and blinded by his need to feel he's worthy and honorable.[2] Shen was arranged to be married to Yevnai but the engagement was called off after  Zed \"killed\" Master Kusho.  Zed and Yevnai were at one point secretly in a relationship even when forbidden by Master Kusho, unknown to Shen though he possibly suspected it.[3]",
    "positions": [
      "Top",
      "Support"
    ]
  },
  {
    "champion": "Shyvana",
    "title": "Shyvana (Character)",
    "abilities": "Jarvan IV was saved by  Shyvana after escaping from the Noxian capture and later helped her in slaying her mother, Yvva, and, out of gratitude, she earned a spot in the Demacian Elite Guard. In Lux comics, it was revealed Jarvan loved someone that wasn't so different from the mages. That person may be Shyvana herself. She would later join the Dragonguard, a special branch of the Demacian military tasked in defending Demacian lands from dragons. While some are close to Shyvana and trust her, others are skeptical due to her nature. In Rise of the Sentinels, Shyvana was imprisoned by the Mageseekers. Becoming disillusioned with Demacia's magical prejudices, Shyvana  gives in to the ruination after  Viego's awakening, destroying a Mageseeker compound and terrorizing the Demacian army. Vayne claims that Shyvana is a monster, so she distrusted her even before she was possessed. After  Lucian and  Senna arrived and helped Vayne knock Ruined Shyvana out, Vayne was prepared to kill her until Senna intervened.  Senna determined that Shyvana's true self is still within her. After  Viego was defeated, Shyvana was freed along with the other champions from his control and returned to her normal self. ",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Singed",
    "title": "Singed (Character)",
    "abilities": " As Singed forced Warwick into being a test subject for one of his unethical experiments, it can be assumed that Warwick hates him more than anything. Given that Singed also showed no remorse towards Warwick as he subjected the latter to many brutal procedures, it can also be assumed that he sees Warwick not as a living organism, but as an object to be researched and studied. Singed helped Noxus invade Ionia by giving them a toxic substance that Noxus used to kill their enemies and raze their land. This would affect many people, including  Riven, who was scarred from the sight of the substance being used on others,   Irelia and  Karma, whose forces were killed by the substance, and  Master Yi, whose village was razed by the substance. Singed saw Hadri and Palo as nothing more than test subjects, showing no empathy toward them as he cruelly experimented on them and disciplining them by blasting them with cold sump water for failing his standards. When Hadri tried to empathize with him, Singed mocked him and told Hadri that he owed him after begging him to cure his illness, but promised that he wouldn't die. Once Hadri stood up to him, Singed began to flood the lab to drown them so he could dispose of them and start over. When they escaped, Singed asked them if they knew him and when he was unable to answer, Singed believed them to be mindless vegetables and deemed the experiment a failure. Once Hadri finally remembered who Singed was, he told him that he'd done better as a Thinker test subject than his second Thinker before he and Palo died. ",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Sion",
    "title": "Sion (Character)",
    "abilities": "In life, Sion was the  Hand of Noxus. Sion was resurrected at the order of the  Black Rose, likely by  LeBlanc herself with  Vladimir being one of the main people in charge. Once  Swain overthrew  Boram Darkwill (thus becoming the new Grand General) he learned of Sion's existence and plotted to use him as his own weapon. Sion was used in the second Noxian invasion of  Ionia where he fought the resistance led by  Irelia who was assisted by  Karma,  Akali,  Kennen and  Yasuo.",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Sivir",
    "title": "Sivir (Character)",
    "abilities": "",
    "positions": [
      "ADC"
    ]
  },
  {
    "champion": "Skarner",
    "title": "Skarner (Character)",
    "abilities": "Skarner views Milio negatively and sees him as an extension of his great aunt, who rebelled against the Yun Tal.[2] Skarner is aware of Qiyana's plot to seize power. Presumably, he disapproves.",
    "positions": [
      "Jungle",
      "Top"
    ]
  },
  {
    "champion": "Smolder",
    "title": "Smolder (Character)",
    "abilities": "Smolder's mother is fiercely protective towards him, attacking anyone that tries to harm him. When he was deserted on an island, she spent decades searching for her son never giving up hope that she would find him. Since their reunion, she taught him about the feats of his predecessors and how to hone his abilities, so that he matures into a powerful dragon. While she doesn't speak verbally, Smolder's interpretations of her speech imply that she acts like a doting mother towards him always concerned with his activities. Smolder first encountered Marinos during a hunt, with the two becoming companions. Marinos raised the young dragon throughout his early childhood, giving him the name \"Smolder\" along with teaching him how to speak and utilize his powers, though he kept his existence a secret from Noxians passing through for fear that they would sell him for monetary value. He told Smolder stories of the imperial dragons from Camavor, inspiring him to be like his predecessors. Eventually, Marinos grew up and was unable to continue raising him, though Smolder still regards Marinos highly and hopes to see his new family.",
    "positions": [
      "ADC",
      "Top",
      "Mid"
    ]
  },
  {
    "champion": "Sona",
    "title": "Sona (Character)",
    "abilities": "Sona is the adoptive daughter of 2 Lord Barrett and Lady Lestara from House Buvelle, and adopted sister of Kahina. She is very close to all of them, especially her mother Lestara. They also know that she is magical and protect her from the Mageseekers. Sona met  Irelia at some point when she came back to  Ionia She met  Taric before his exile. During the events of Call of Power , Sona traveled with  Ryze to the Hirana Monastery after the  Noxian invasion and fought the Navori Brotherhood who ambushed them.",
    "positions": [
      "Support"
    ]
  },
  {
    "champion": "Soraka",
    "title": "Soraka (Character)",
    "abilities": "Soraka, being a celestial being, knows about Aurelion Sol and seems to know him personally. While Aurelion sees Soraka as having lowered herself, she disagrees with him and sees beauty in being in the mortal world. Pantheon once told  Soraka \"If only your kind could see what you see, Soraka, they would weep for you as you weep for us.\"\nSoraka refers to  Pantheon as Warrior with a spear and he refers her as The Seer, Soraka once designed the Pantheon in a constellation of stars. Taric is quite generous to Soraka, for example, when  Soraka tells him \"Your star shines brightly.\" and he replies \"There is no one as brilliant as you.\" Both seem to share the vision of looking to mortals with kindness when Soraka says \"This world has great potential\". and  Taric nods, saying \"Each life is uniquely faceted.\" Soraka knows the pain of the  Lunari twins, but tells them not to feel it. what  Alune considers would be to deny her and her  brother their existence. Diana met a Celestial being descending from the Astral Grove.  Soraka refers to  Diana as the Pale-haired Woman/Sable-haired Girl Soraka refers to  Leona as Woman whose face burned like the sun",
    "positions": [
      "Support"
    ]
  },
  {
    "champion": "Swain",
    "title": "Swain (Character)",
    "abilities": "Irelia cut off Swain's left arm during the Battle of the Placidium. Swain and Darius are two of the three heads of the Trifarix of  Noxus, embodying the Noxian values of Vision and Might respectively, along with The Faceless One, who embodies Guile. When audiences for the Reckoning arenas waned and Draven fell into a drunk stupor, Swain found him and offered him a role in his coup against Boram Darkwill. He became integral to Swain’s plan, killing Darkwill himself. He is considered a close ally by Swain. Katarina serves as an assassin for the Trifarix council, killing people at their command. It is also hinted that Swain may know what happened to her father. Urgot was sent away from  Noxus to  Zaun as a part of Swain's coup, as he was seen as a liability and a potential threat to Swain's plan. It is likely that Raum worked for Mordekaiser or was used by him, as Swain found Raum in the Immortal Bastion.",
    "positions": [
      "Support",
      "Mid"
    ]
  },
  {
    "champion": "Sylas",
    "title": "Sylas (Character)",
    "abilities": "Sylas was abducted by the Mageseekers at a very young age and had his magic detection abilities used to find and capture other mages. After an incident where Sylas ended up killing two mageseekers by accident to protect a little girl, he fled to the wilderness. Eventually he would be caught by the mageseekers and imprisoned for 15 years. He would harbor great resentment of his captors as they would treat him like an animal and barely give him any food. Sylas formed a bond with  Lux while he was imprisoned. In exchange for information of the outside world, he would teach her to control her magic due to magic being outlawed in Demacia. He later manipulated her and used her power to escape. He would eventually make amends with her and come to her aid when the mageseekers attacked her mages settlement. While Lux has not forgotten Sylas' betrayal, she undestands he is more than just a murderer. After escaping his execution, Sylas and his followers fought  Garen. He would best him in every fight they had, only retreating when Garen's reinforcements arrived. After escaping his execution, Sylas and his followers almost executed  Jarvan IV before fleeing. He had intended to execute Jarvan III, but then found out that the king was already mysteriously dead in the chamber he and his guard retinue had retreated to. Sylas would form an alliance with the Winter's Claw, who later helps him attack Demacia. Sylas encountered  Galio who came to aid Lux, Garen, and other Demacian soldiers during this attack on Demacia from the north.",
    "positions": [
      "Mid",
      "Top"
    ]
  },
  {
    "champion": "Syndra",
    "title": "Syndra (Character)",
    "abilities": "Due to her abusive upbringing and being imprisoned for decades in Fae'lor of Ionia, she has grown hateful against all Ionians to an extent that she even approves of Noxian presence. However, she has no prior knowledge of Noxus before the events of her release. Although she seems to thank the Noxians for standing against the people who locked her, she also has little care for them, killing all of the invaders on the fortress and destroying a Noxian warship with a mere glance of her eyes. Syndra, The Dark Sovereign ",
    "positions": [
      "Mid"
    ]
  },
  {
    "champion": "Tahm Kench",
    "title": "Tahm Kench (Character)",
    "abilities": "Tahm Kench knows a lot of champions (both as fellows and adversaries, those who get consumed by their inner demons, and those who overcome them) and all Yordles have encountered him at various times (easy to manipulate when socially outcast, harder when not so). He seems to be on friendly terms with, or at least respect,  Aatrox (Tahm Kench calls him 'brother') given both manipulate mankind (their foibles and their lust for bloodshed, respectively) for personal gain as well as both being timeless entities known across the ages in various names and forms. Tahm Kench is considered both an equal and a rival by  Evelynn, as they are both long-lived demons that feed on human emotion for sustenance, with Tahm Kench preying on greed and the misery of loss, while Evelynn preys on lust and the pain she causes her victims. Kalista occasionally comes after him; however, he is safe from her as he technically did not betray his victims, just followed his contracts.",
    "positions": [
      "Top",
      "Support"
    ]
  },
  {
    "champion": "Taliyah",
    "title": "Taliyah (Character)",
    "abilities": "Yasuo became the teacher Taliyah had been looking for, as her people didn't understand her power, and Noxus sought to use her as a weapon. Before parting ways, Taliyah gave Yasuo the thread of handspun Shuriman wool with which he ties his hair back in-game. As an only child, Taliyah sees Yasuo as the older brother she never had.[3] Having heard only rumors of both the Ancient Shuriman capital and  Azir's rise from the sands, Taliyah is convinced he is a threat to her family and her homeland when nothing could be further from  the truth. On the way to find her family, Taliyah encountered a wounded  Sivir and nurtured her. Nasus encountered both of them when looking for  Sivir in Vekaura. Taliyah was at first suspicious of his motives but later came to trust him. When  Xerath and his army came to decimate the place and find  Sivir,  Nasus bought time for Taliyah to help others escape. After her return to Shurima, Taliyah met  Kai'Sa and they fought the Voidborn together, including some of  Rek'Sai's Xer'Sai. Taliyah parted way with the group she travelled with to join  Kai'Sa in search of the mythical paradise, Xolan.",
    "positions": [
      "Jungle",
      "Mid"
    ]
  },
  {
    "champion": "Talon",
    "title": "Talon (Character)",
    "abilities": "Talon was bested by and consequently served under General Du Couteau,  Katarina and  Cassiopeia's father. Talon was assigned the task of killing  Katarina after her first failure by her father,[1] his assassination failed, which left a scar on her left eye. He decided to bear his failure instead of reattempting, due to the hypocrisy it would be compared to Katarina's case. He named the very blade he used after Katarina, and keeps it in case he is reassigned to kill her.",
    "positions": [
      "Mid",
      "Jungle"
    ]
  },
  {
    "champion": "Taric",
    "title": "Taric (Character)",
    "abilities": "(TBA) Garen was Taric's lifelong friend. His nobility status allowed him to keep Taric safe from being accused of high treason and executed. But even Garen (who still believed in Taric but deep down thought he was wasting his talents by fooling around) turned on Taric after Voidborn killed the Shield of Valoran's men, resulting in his banishment and sentence to the Crown of Stone by the Might of Demacia himself. Based on  Sona's in-game voice lines, she has met Taric before his exile. Taric appreciates the beauty in all things ( music,  life). His role as Aspect of the Protector, and especially past experiences, have made  The Void his enemy.",
    "positions": [
      "Support",
      "Mid"
    ]
  },
  {
    "champion": "Teemo",
    "title": "Teemo (Character)",
    "abilities": "Teemo and Tristana have a strong bond, with him considering her to be an important figure in his life. Whether their relationship is romantic or not is open to interpretation.[1] Teemo shows respect towards Kled and is able to memorize his full title, though he expresses bewilderment towards the idea of the Bandle Scouts. Teemo is friends with  Corki,  Lulu and  Kennen. During one of his mission in  Bilgewater, Teemo was captured by  Graves to earn bounty for Yordles, while  Twisted Fate did not interfere. He would later be saved by  Corki,  Lulu and  Tristana. As seen briefly in his journal, Teemo may know about  Viego.",
    "positions": [
      "Top",
      "Jungle",
      "Support"
    ]
  },
  {
    "champion": "Thresh",
    "title": "Thresh (Character)",
    "abilities": "Thresh was a member of the Brotherhood of Dusk located in the heart of the Blessed Isles, turned undead when the Ruination of Helia struck. Thresh was directly responsible for the Ruination of the Blessed Isles, as he was the one who led  Viego to the Waters of Life. Between conspiring against him with Gangplank and letting  Senna's soul escape his lantern, Thresh fell out of favor with Viego. In turn, Thresh plotted against Viego and siphoned the excess Black Mist he was producing, in order to become  unbound from the Shadow Isles. Thresh tricked  Lucian's wife  Senna, claiming her soul and storing it in his  lantern. Lucian traveled to Bilgewater in pursuit of the Harrowing to locate Thresh. It was then he found out Senna's soul is trapped inside the Chain Warden's  lantern. Lucian continued to pursue the Mist to free her and finally succeeded. Thresh made a deal with  Lucian for the vital information that may help him save  Senna. After becoming unbound from the mist with Viego being defeated, Thresh came to the  Sentinels of Light for the soul promised by the deal, but they managed to escape. Thresh now plots to capture the escaping Sentinels. Lucian and  Senna are now dedicated to hunting Thresh. Thresh clashed with  Ahri,  Braum,  Illaoi,  Miss Fortune,  Pyke, and  Yasuo in Ruined King, when they sailed to the Shadow Isles to try and stop him and Gangplank from unleashing Viego.",
    "positions": [
      "Support"
    ]
  },
  {
    "champion": "Tristana",
    "title": "Tristana (Character)",
    "abilities": "Tristana, Teemo,  Lulu and  Corki are friends. Tristana finds  Lulu to be quite a handful and bothersome yordle.  Rumble has an obvious (named his mech 'Tristy') crush on her. Draven had encountered both  Lulu and  Tristana, fought and fled from them during his return trip from Basilich to Noxus Prime. Graves captured  Teemo for the bounty on yordles while  Twisted Fate refuses because \"messing with Yordles brings a whole heap of trouble.\"  Corki, Lulu and  Tristana fought  Graves when trying to save Teemo, which ended up in Graves being  turned into a frog and the Yordles escaping. ",
    "positions": [
      "ADC",
      "Mid"
    ]
  },
  {
    "champion": "Trundle",
    "title": "Trundle (Character)",
    "abilities": "(TBA) Trundle managed to form an alliance with  Lissandra. His True Ice club (\"Boneshiver\") was originally  Lissandra's. In exchange for it, Trundle agreed to muster a troll army to fight alongside the Frostguard. In his search for the world runes,  Ryze confronted Trundle and his trolls. Legends of Runeterra cards suggest  Ashe's  Avarosan and  Trundle's trolls are in direct conflict which has resulted in a number of loss for the Avarosan. For that reason, Ashe wants the race to be exterminated. ",
    "positions": [
      "Top",
      "Jungle"
    ]
  },
  {
    "champion": "Tryndamere",
    "title": "Tryndamere (Character)",
    "abilities": "Ashe and Tryndamere are Bloodsworn, a political marriage, but the two eventually developed genuine affection for one another. Tryndamere originally married Ashe in exchange for the protection of his remaining tribe after  Aatrox's massacre. All of this is, in turn, an inside reference at Riot. The name of Riot's co-founder Marc 'Tryndamere' Merrill's wife is Ashley. Tryndamere's nemesis is  Aatrox, who is the main reason why most of Tryndamere's tribe was destroyed. Braum stopped Tryndamere when he lost control trying to prove his worth to  Ashe. It's rumored that  Braum introduced him to Ashe. He is hostile towards the Winter's Claw, who disdainfully lumped him into the Avarosa's \"decadent lifestyle\" even though Tryndamere actually originated from another hardy nomadic tribe, much like  Sejuani.",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Twisted Fate",
    "title": "Twisted Fate (Character)",
    "abilities": "Their partnership started when they recognized a kindred soul in one another across a table during a high-stakes game in Mudtown. They both shared the same reckless passion for danger and adventure, which is what encouraged them to form their partnership. Graves being the brawn, and T.F. being the brains they were an unusually effective team from the outset. Their mutual sense of roguish honor grew into genuine trust, and together they hustled across Valoran. They were forced apart when a heist went south, with Graves getting sent to The Locker despite Twisted Fate’s efforts to save him. Graves endured years of torture and solitary confinement, during which time he nursed his bitter anger toward his old partner, and, convinced T.F. had betrayed him, Graves was determined to have his revenge. Graves reunited with T.F. again when Miss Fortune set them up, yet they were forced to put aside their differences in order to escape almost certain death in the ongoing conflict between her and Gangplank. Even though Graves and T.F. were tempted to reconcile their relationship, both knew it may take a while for Graves to completely trust T.F. again, still, the latter was happy to have his old friend back. However, since Graves still kept some distance from T.F., in the short story Destiny and Fate, T.F. proactively tries to show Graves that he can trust him again. T.F. had a history of taking off when things got ugly and so, T.F. wanted to stay and retrieve the Abyssal Crown even if it meant risking his life so he could prove to Graves that he wouldn't leave him to pick up the pieces anymore. In the same story, when Graves shows up next to T.F. bleeding, the latter notices and expresses his concern, something that Graves actually appreciated even if he didn't say it out loud. During the Burning Tides events, T.F. jumps after Graves to save him from drowning despite not knowing how to swim and being terrified of drowning himself.",
    "positions": [
      "Mid",
      "ADC",
      "Top"
    ]
  },
  {
    "champion": "Twitch",
    "title": "Twitch (Character)",
    "abilities": "",
    "positions": [
      "ADC",
      "Support"
    ]
  },
  {
    "champion": "Udyr",
    "title": "Udyr (Character)",
    "abilities": "Udyr serves as the shaman for the  Winter's Claw and is  Sejuani's oathfather. He was once close to Kalkia, Sejuani's mother. Udyr and  Lee Sin formed a friendship after the latter traveled to the Freljord to learn more about spirits. He traveled with Lee Sin back to Ionia in order to learn more about spirits and aided in defending the Hirana monastery from Noxian invaders. Lee Sin gave Udyr the blindfold he adorn on his arm, a reminder of his commitment to self-mastery. Udyr can harness the power of Freljordian demigods, such as  Ornn,  Anivia,  Volibear, the  Seal Sister, and  the Iron Boar. Despite harnessing the power of the Great Spirit of the Bear, Udyr does not trust  Volibear. He respects his brother  Ornn, the Great Spirit of the Ram, far more.",
    "positions": [
      "Top",
      "Jungle"
    ]
  },
  {
    "champion": "Urgot",
    "title": "Urgot (Character)",
    "abilities": "Swain saw Urgot as a threat to his plan to take over Noxus, and as such betrayed Urgot by sending him to Zaun to be captured by Chem-Barons. Caitlyn and Vi were the ones to capture Urgot and imprison him. After a brief escape attempt, the two defeated Urgot again and reimprisoned him.",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Varus",
    "title": "Varus (Character)",
    "abilities": "Varus regards most of his fellow Darkin as his brothers and sisters at arms, having fought alongside and against them during the Great Darkin War. During this war, Varus was often sent out by his Darkin siblings to assassinate enemy generals and obliterate entire armies. At some point during the war, it's implied that Varus fought alongside four other Darkin that were notably powerful and destined to one day reunite and bring ruin to the world. These notable Darkin are  Aatrox,  Rhaast,  Naafiri and a currently unknown fifth Darkin. After emerging from the well of Pallas, Varus focused on enacting brutal vengeance against the world by reuniting the rest of his Darkin siblings, especially the four others destined to unite with him. After his separate personalities appealed to the humanity lost within him, Varus instead focused on fighting for himself and to possibly regain his lost humanity rather than for the Darkin. Valeeva was one of the Darkin present during the earliest days of the war. She and Varus regard each other as brother and sister, having fought side by side during the war and sharing a brutal desire for vengeance against others. After the  Aspect of Twilight killed several Darkin and learned to imprison the rest, Valeeva was one of the survivors but hasn't been seen by Varus since. When Varus emerged out of Pallas, one of his first missions lead him back to the deserts of  Shurima in search of Naafiri, who he deeply regards as his sister. While searching for her in a Shuriman tomb, he comes to realize that it has already been emptied, meaning Naafiri managed to escape before Varus's arrival. Naafiri is one of the five Darkin destined to reunite with Varus in bringing the world to ruin. Though it's unclear whether or not the two have reunited since his search for her, Varus deeply respects Naafiri's sense of unity, seeing it as strength and wishing to apply the concept to the rest of his Darkin siblings to work together. Aatrox is one of the most respected of the Darkin and the first to be imprisoned during the Great Darkin War. It's implied that Varus fought alongside Aatrox at some point during the war, as he is one of the five Darkin destined to reunite and bring ruin to the world. Though the two share a desire the bring oblivion to the world, Varus wishes to do so out of pure revenge, an emotion Aatrox thinks is weak and unbecoming of him as he criticizes the hybrid form he has taken.",
    "positions": [
      "ADC"
    ]
  },
  {
    "champion": "Vayne",
    "title": "Vayne (Character)",
    "abilities": "Vayne is searching for  Evelynn, as she is the demon who killed her parents. She obsessively craves revenge, which motivates Vayne in her life as a hunter. During a Black Mist attack by  Viego on a Demacian city, Vayne and  Poppy fought side by side against the undead army. Vayne fought against  Shyvana while she was  possessed, and tried to kill her for being a monster.  Shyvana was saved by  Lucian and  Senna, who stopped her and told her that  Viego was their real enemy. Vayne begrudgingly accepted  Graves as a friend, when the two of them were Sentinels of Light.",
    "positions": [
      "ADC",
      "Top"
    ]
  },
  {
    "champion": "Veigar",
    "title": "Veigar (Character)",
    "abilities": "Mordekaiser tortured Veigar to gain knowledge about other realms. Eventually, Veigar's personality would shape to be more like his captors. However, due to his yordle nature, he could never perfect his masters cruelty, only a caricature of it. Veigar knew LeBlanc, who was also forced to work for Mordekaiser.[6] In the old lore, Veigar is a friend of Lulu. Their connection in the new lore is left unambiguous.",
    "positions": [
      "Mid",
      "Support"
    ]
  },
  {
    "champion": "Vel'Koz",
    "title": "Vel'Koz (Character)",
    "abilities": "Kassadin seeks to keep the Voidborn from crossing over to Runeterra and thus is his enemy (and a nice research subject).\n Malzahar on the other hand seeks to facilitate the crossing and thus is his ally (Vel'Koz is no stranger to killing other Voidborn who might destroy his research materials, though). ",
    "positions": [
      "Support"
    ]
  },
  {
    "champion": "Vex",
    "title": "Vex (Character)",
    "abilities": "Vex's parents tried to help her find her \"yordle spirit\" when she was younger, though their positivity only made her resent them. After cutting ties with  Viego, she went back to her parents to boast about her crimes so they would hate her, but to her disappointment they forgave her and claimed that they loved her no matter what. Despite her hatred towards them, Vex created 2 effigies of her parents to keep herself company while reenacting her childhood and talking to them while pretending that they're her parents, showing she values their presence to a degree. Milty is Vex's adoptive uncle. He always tries to understand his niece and influence her positively, but she refuses to deal with him due to his positive attitude. When he came to find Vex on the Shadow Isles, he tried to forcibly take her back to Bandle City, but she decided to crush his positive worldview with her nihilism so he would leave her alone, causing him to leave while crying in despair. Vex had an alliance with  Viego to plunge the world into darkness and gloom until Vex found out that his real motive was to revive his wife from the dead. Allay has a one-sided friendship towards Vex, referring to her as Vee and organizing birthday parties for her, to Vex's annoyance. Grimm is in love with Vex and feels infatuated towards her gloomy nature, often making dramatic shows to profess his love towards her. In return, she is shown to genuinely tolerate him despite being disinterested by his displays of love.",
    "positions": [
      "Mid"
    ]
  },
  {
    "champion": "Vi",
    "title": "Vi (Character)",
    "abilities": "Jinx is Vi's sister, they both took different paths when they were young, although Vi's main job is to capture her, she also looks for a way to help her. Vi and Ekko were friends since they grew up together in Zaun, their relationship was stagnant on Ekko's part after Vi was accepted into Piltover. Caitlyn is Vi's co-worker and she was the one who helped her join Piltover, they have been together for a long time. Jayce Talis",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Viego",
    "title": "Viego (Character)",
    "abilities": "Kalista is Viego's niece and was his most trusted general in life. Despite being her uncle, Kalista was like an older sister to Viego, the two were friends for a long time since he was largely ignored in favor of Kalista's father. When her grandfather died and Viego became king, his negative traits were worsened and they began to drift apart, however she was still loyal to him. Kalista managed to protect Viego from an assassin, but resulted in Isolde getting poisoned instead. She would set sail in order to find a cure, but found it too late and was imprisoned as a traitor for her failure. She was eventually convinced by  Hecarim to lead Viego and their army to the Blessed Isles for the Waters of Life. When the masters of the island refused to let them use the water, Viego ordered her to kill anyone who opposed them. Kalista refused and was stabbed by Hecarim before her forces clashed with the Iron Order. Hecarim was the leader of the Iron Order, a brotherhood of knights which vowed to protect the king's lands. Under Viego, Hecarim and the Iron Order acted as the king's enforcers and quelled growing dissent after Viego began neglecting his duties. Hecarim and his knights accompanied Viego to the Blessed Isles. They held off Kalista's forces and pillaged the city while Viego attempted to heal Isolde. In The Despoiler of Havenfall, it is revealed that Hecarim does not think highly of Viego and only continues to follow him because he can spread the Black Mist across Runeterra and allows him to pillage the land. Although Viego calls Vladimir his uncle in game, they are only distantly related due to both descending from the royalty of Camavor.[2] At some point after being taken by his Darkin master, Vladimir started sending customary, yearly letters to his original kingdom. After Isolde was poisoned, a grief stricken Viego refused to respond, not knowing Vladimir had the power that could have saved her.[3] Viego's wife is a seamstress named Isolde. Viego was selfish, self-centered, young, immature, and had a lot of power. So when he saw someone as beautiful as Isolde, he had to have her. She accepted because she was a commoner from a conquered country.[4] Viego was a perfectionist in his relationship with Isolde, so when she couldn't live up to his expectations, he would berate her. However, the thought of not being the perfect husband for her disturbed him and he would abandon the memories of the times they fought.[5] It is uncertain if Viego truly loved Isolde or loved that she was his because he was raised to take anything he desired. Regardless, he doted and focused on her and ignored his duties as king. Viego’s love for Isolde is characterized by utter obsession to the exclusion of everything else, and driven by a lack of understanding of any motivations other than his own.[6]",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Viktor",
    "title": "Viktor (Character)",
    "abilities": "Note: The following description will prioritise the facts as listed in Viktor's biography as opposed to Blitzcrank's, given that this is Viktor's wikipage. The only notable conflicts would be in Blitzcrank's origins and the reasons for their separation. Where Blitzcrank's biography states he was an abandoned golem given sentience through the means of a hextech crystal, Viktor's biography describes events differently. Blitzcrank also credits the parting of their ways to a chem-baron. In terms of matters omitted, Blitzcrank does not seem to be involved in the events in Piltover between Professor Stanwick and Viktor. Blitzcrank was a custom-built golem, constructed by Viktor in order to help in the clean-up efforts following a devastating chem-spill in Zaun. He grafted a sophisticated series of cognitive loops onto existing automata-technology, which formed the basis of Blitzcrank's intelligence and later unintended sentience. The two worked together to better the lives of those affected by the spill. Unfortunately, their efforts failed to prevent more deaths, and so the two parted ways. Later in Piltover, Professor Stanwick claimed Blitzcrank as his own invention. Viktor challenged him, but backed by no one, he lost the case. The two currently have no reason to be unfriendly with each other. Jayce and Viktor are ex-colleagues and current enemies. They disagree over many topics relating to ethics in science, most pertaining to free will. ",
    "positions": [
      "Mid"
    ]
  },
  {
    "champion": "Vladimir",
    "title": "Vladimir (Character)",
    "abilities": "LeBlanc was forced to serve   Mordekaiser, whose downfall she would later plan. To do so, she approached Vladimir and the two formed a pact and founded the  Black Rose. Vladimir rallied all the Noxii barbarian tribes to siege Mordekaiser's domain while LeBlanc severed the ties of Mordekaiser's magic to The Immortal Bastion, allowing them to be able to defeat The Iron Revenant and end his reign. LeBlanc considered Vladimir her only equal because she has never met any mage that can she considered to be as powerful as her. LeBlanc is also quite aware of the Darkin power that Vladimir absorbed, and she had hoped she could outlive Vladimir and take his power for her own. She has been waiting centuries for him to grow old and die, and may not yet realize that Vladimir is capable of revitalizing himself to stay young and powerful. Vladimir is one of the founders of the organization alongside LeBlanc. He aided the  Black Rose for centuries, such as conducting   Sion's resurrection, creating  Briar, and leading a war against  Demacia in the past. Vladimir, however, is not interested in the political machinations of the Black Rose, only assisting them when needed. Unlike all other members of the Black Rose, he often stood out among others and preferred to show up in public from time to time. Over time, their growing differences in ideology led Vladimir to create his own cult - the  Crimson Circle, and under his tutelage it found a place publicly in the military of Noxus. The quick growth of the Crimson Circle eventually brought LeBlanc into frequent conflict with Vladimir and his inner circle. Vladimir had already alerted his Crimson Circle members through his letters in which the first line says \"Beware  the rose\", which also corresponds to Vladimir's ambition to cut ties of his connection to the Black Rose. Vladimir has recently brought himself back into the public eye, becoming a vocal opponent against the  Trifarix Council, and this has caught  Swain's attention. However, Vladimir's previous public identity has not been completely forgotten, and it is hinted that Swain may know of Vladimir's true nature. One day, a troop of Trifarix soldiers attempted to intercept the old aging Vladimir on his way home, and they all ended up killed and absorbed by Vladimir as a part of his plan to revitalize himself. The incident was witnessed by one of Swain's ravens, in noticing which Vladimir became aware that Swain was watching him.",
    "positions": [
      "Mid",
      "Top"
    ]
  },
  {
    "champion": "Volibear",
    "title": "Volibear (Character)",
    "abilities": "Volibear and the Ursine are allied with  Sejuani,  Udyr and the  Winter's Claw to battle  Lissandra's  Frostguard and  Ashe's  Avarosan. However, Volibear has his own ulterior motives for the Freljord. Volibear has very little respect for  Udyr, who is a shaman and spirit walker of the Winter's Claw that resisted his calling to the spirit walkers of the Ursine clan. Lissandra lost her sight from confronting Volibear back in the early days of the  Freljord. She has since been actively containing his influence by, for example, killing his shamans and those that may join him as well as sabotaging the worship of all old demigods. Volibear was close to  Ornn but they later became estranged due to their differences in ideologies causing their cataclysmic battle that destroyed the home of Ornn's followers, killing them. Volibear is on better terms with  Anivia because they are both tied to the spirit of the land and want whats best for the Freljord.[1] Before becoming the Green Father,  Ivern used to worship Volibear.",
    "positions": [
      "Top",
      "Jungle"
    ]
  },
  {
    "champion": "Warwick",
    "title": "Warwick (Character)",
    "abilities": "",
    "positions": [
      "Jungle",
      "Top"
    ]
  },
  {
    "champion": "Xayah",
    "title": "Xayah (Character)",
    "abilities": "Xayah is a Lhotlan Vastayan who travels Ionia on a crusade to ensure her people's survival and independence. After meeting and getting in a relationship with  Rakan, both travel Ionia to preserve Ionia's natural magic from being controlled by humans. They are still not married, since she wants to hear him proposing to her everyday. Xayah and  Rakan fought  Zed and his Order of the Shadow to prevent them from harvesting a magical grove.",
    "positions": [
      "ADC"
    ]
  },
  {
    "champion": "Xerath",
    "title": "Xerath (Character)",
    "abilities": "(TBA) Nasus and  Renekton imprisoned Xerath after the fall of Shurima, but the  older brother had to trap  his own sibling with him. Xerath is allied with  Renekton as they spent millennia together trapped in a tomb. He drove Renekton mad over the ages and turned him into a relentless creature of pure anger. Xerath does not see Renekton as a noble hero, he represents power being granted to the few by a corrupt society. In Xerath's eyes, Renekton helped to guard a city of subjugation.[1] Xerath later fought  Nasus when The Curator of the Sands was trying to protect  Sivir,  Taliyah and the citizens of Vekaura from Xerath. Everything Xerath had done prior to Ascension- heinous as his acts of murder were - were all done out of a twisted sense of loyalty to  Azir. When that went unsatisfied Xerath sought the power to free himself from being a slave and tear down the decadent society built on the backs of slaves. From his perspective, Xerath was punishing an injustice against the man who had promised him freedom, but had never given it to him.  Azir has returned ascended himself, and is a threat to Xerath. Xerath is hunting down  Sivir since her inheriting  Azir's royal bloodline may prove a threat to him. According to  Ryze, Xerath is an 'abomination of magic' and that his hold over the magical powers he wields is 'feeble'. Xerath has fought  Pantheon and dozens of Rakkor soldiers. Samira's home was destroyed by his followers.",
    "positions": [
      "Mid",
      "Support"
    ]
  },
  {
    "champion": "Xin Zhao",
    "title": "Xin Zhao (Character)",
    "abilities": "(TBA) Xin Zhao was originally an Ionian born Noxian gladiator who pledged his service to Jarvan III,  Jarvan IV's father, after he spared the lives of those who fought at Kalstead. He later became as close to the king and the young prince as a family member. Xin Zhao took an oath to Tianna Crownguard that she may kill him should anything happen to king Jarvan III. ",
    "positions": [
      "Jungle"
    ]
  },
  {
    "champion": "Yasuo",
    "title": "Yasuo (Character)",
    "abilities": "Yasuo is an  Ionian swordsman once accused of treason for allegedly murdering Elder Souma, his own master whom he was supposed to protect. He was hunted down across the island continent under the evidence that the killer employed a wind technique, one that only Yasuo has mastered in the present day. He was forced to kill his former allies, likely the entirety of his school. He later crossed paths with  Taliyah while on the run, teaching the Shuriman stone mage how to control her powers. When they parted ways, she gifted him a long thread from her handspun wool tunic which he uses to tie his hair up. After parting way with Taliyah, Yasuo became determined to find the true killer of his Elder. He suspected  Riven of being the Elder's killer and confronted her. This was previously evidenced in interaction quotes with her. \"Wait, that  technique... huh\"\n\"Huh,  three swift strikes... \"\n\"Another  wind blade?\"\n\"Who taught you  that?\"\nEventually, Riven confessed to unintentionally killing Elder Souma, whose  wind technique shattered her  blade and killed him with a stray shard. However, Yasuo admitted to dereliction of duty, for he could have protected Elder Souma had he not left to engage the  Noxians. Despite being cleared of his accusations, Yasuo is still infamously known across Ionia as the killer of his master. Yasuo's presence or absence making a difference was highlighted during Riven's trial, when he focused the Wind Technique on Riven's sword as Souma would have, and the shard that killed his master nearly did the same to Asa Konte, Riven's adopted father. This time, Yasuo was able to stop the shard before it could cause any harm. In the second  Noxian invasion of  Ionia,  Irelia's call for help to defend a seaside village from the Noxian army including  Sion was met by  Akali,  Karma,  Kennen and Yasuo whose arrival turned the tide of the battle.",
    "positions": [
      "Top",
      "Mid",
      "ADC"
    ]
  },
  {
    "champion": "Yone",
    "title": "Yone (Character)",
    "abilities": "Yone is the older half-brother to  Yasuo, whom he was very close to. Yone taught Yasuo many important lessons when he was young. When Yasuo was running away when accused of killing Elder Souma, 6 Yone was heartbroken and filled with negative thoughts and feelings that fed the azakana he would later confront. When Yone finally caught up, Yasuo was forced to kill his own brother whose death would haunt him for a long time. Later, when Yasuo went to the Spirit Blossom festival in Weh'le, he was confronted by a resurrected Yone who was trying to kill an azakana that pretended to be a monk from the 3 Greenglade Elder's order.[1] After Yasuo let go of his own past, the brother defeated it and parted way in peace, although Yasuo was expecting Yone wanted vengeance. It isn't clear if Yone has forgiven his brother, or if Yasuo has forgiven himself. Yone met  Lillia at some point (likely when they were both traveling to the Spirit Blossom festival of Weh'le) and has vowed to protect her from any azakana and Demon of Nightmare during their travels. Upon Yone's release, it was heavily hinted that the relationship dynamic between Yone and  Lillia is meant to mirror the master / student dynamic of  Yasuo and  Taliyah. The former is mentioned in the story 'The Unforgiven' - \"In her, Yasuo saw an unlikely student, and in himself, an even more unlikely teacher,\"[2] and the latter is further supported by Michael Yichao, Yone's writer.[3] \"Fun fact: Yone knows and has met Lillia! He is rather protective of the innocent dream fawn.\"[4]",
    "positions": [
      "Top",
      "Mid"
    ]
  },
  {
    "champion": "Yorick",
    "title": "Yorick (Character)",
    "abilities": "Illaoi's faith would compel her to kill a man like Yorick, but her recent experiences had given her enough of an open mind to cooperate with the monk. In their philisophical debate,  Yorick argues that helping the dead find peace is more important than banishing them back into the cycle of life. Furthermore, his power to compel the dead would align with the Buhru law of motion, either by commanding the Black Mist or rescuing tormented spirits. Yorick dreamt of destroying the Ruined King that decimated Helia. This pursuit would drive him to sacrifice his lifelines, such as leaving his seat of power with Illaoi in the first attempt, or giving away the Maiden and his Water of Life to the Sentinels that would succeed in the second attempt. Although, he was disappointed to learn that Viego's banishment has no effect on the Black Mist, and therefore his own predicament. When the Sentinels met Yorick, he became confident that their strength could stop Viego once and for all. He sacrificed his powers—the Maiden and the Water of Life—knowing that they will be critical for victory.",
    "positions": [
      "Top"
    ]
  },
  {
    "champion": "Yuumi",
    "title": "Yuumi (Character)",
    "abilities": "",
    "positions": [
      "Support"
    ]
  },
  {
    "champion": "Zac",
    "title": "Zac (Character)",
    "abilities": "Zac was born from a chem spill in Zaun's Sump level, gaining basic sentience to respond to outside stimuli. He was sequestered in a laboratory by a group of alchymists funded by Chem-Baron Saito Takeda, to be molded into a super soldier under his command. Two of the alchymists grew emotionally attached to Zac and, when they discovered who their benefactor was, spirited away with him deep within Zaun, lovingly raising him as their own son while being on the run from baron Takeda's thugs. Zac responds to people's emotions and acts accordingly, his mood changing with the reigning sentiment at any given time, best exemplified when he went berserk after his parents were killed by Takeda's men. After burying them, he decided to set off and help the people of Zaun, fighting chem-thugs and fixing the city's infrastructure when the opportunity presents itself. Although what height Zac truly stands at is very difficult to know since his height is variable, based on his minimum and maximum heights he is appropriately 6'5ft tall. This height is perfect for him to be at specifically since he looms over most characters. ",
    "positions": [
      "Jungle",
      "Top",
      "Support"
    ]
  },
  {
    "champion": "Zed",
    "title": "Zed (Character)",
    "abilities": "(TBA) (TBA) (TBA) Zed found Kayn when he was 10 year old, and has taken him as a apprentice.",
    "positions": [
      "Mid",
      "Jungle"
    ]
  },
  {
    "champion": "Zeri",
    "title": "Zeri (Character)",
    "abilities": "Both Zeri and  Ekko are teenage residents of Zaun, and became friends after Zeri freed a group of hostages, including Ekko's parents, from a warehouse. In a note implied to be from Zeri, codenamed Z, she talks about saving  Blitzcrank again and their mothers talking about a potluck, saying she'll bring the ube ice cream he enjoys. Both  Ekko and Zeri share a dislike for Piltovans. The only difference is while Ekko is implied to be a fan of  Seraphine, Zeri doesn't really like her as much, saying that her songs aren't enough to inspire change. Zeri and  Blitzcrank have had several run-ins before, with Blitz helping her climb a clocktower and Zeri having to save him from Chem-Punks on several occasions. It's implied Zeri has had encounters with  Jinx before, mostly involving Zeri dodging Jinx's rockets. ",
    "positions": [
      "ADC"
    ]
  },
  {
    "champion": "Ziggs",
    "title": "Ziggs (Character)",
    "abilities": "Ziggs is quite terrified of  Jinx (she constantly wants to hug him). Jinx believes he is a product of her imagination, more specifically her conscience. After a night of mischiefs with her all around Piltover, Ziggs now lives with her in Zaun. Ziggs sees  Heimerdinger as his idol and used to work for him before going to Zaun with Jinx. ",
    "positions": [
      "ADC",
      "Mid"
    ]
  },
  {
    "champion": "Zilean",
    "title": "Zilean (Character)",
    "abilities": "While they have never directly interacted, Zilean and Jax are among the only surviving Icathians left. ",
    "positions": [
      "Support"
    ]
  },
  {
    "champion": "Zoe",
    "title": "Zoe (Character)",
    "abilities": "Aurelion Sol and Zoe are sorta friends—but he knows not to trust her. And in fact she is his best hope of getting free—after he learns what he needs.[1] She is as powerful as  Aurelion Sol.[2] She protected him from the wrath of  Pantheon, the Aspect of War and speaks to him as if he were her dog. She \"borrowed\" a chime from  Bard, or it was given to her. Zoe heralds change while Bard prevents disasters, so they probably meet from time to time. Zoe really likes  Ezreal, and as such she considers  Lux her rival. Based on their interactions in  Legends of Runeterra, Zoe and  Lulu seem to know each other on a friendly term. She took the key from  Fiddlesticks, which was used to unleash something \"beautiful and terrible in its joy\".[3] The previous Aspect of Twilight, Myisha, led the Darkin Ta'anari to  Nasus, who guided them to the Chalicar, the blade that belonged to the Ascended queen Setaka and belongs to  Sivir in the present day. Ta'anari used the weapon to perform a ritual that reverted the Ascension of the nearby Darkins, vaporizing them. She and other Targonian Aspects later gave the mortals the tool to trap the remaining Darkins. As a result, the Darkins, who are now roaming free again, especially  Aatrox, despise every Aspect and their host, most noticeably The Aspect of Twilight/Zoe.",
    "positions": [
      "Mid"
    ]
  },
  {
    "champion": "Zyra",
    "title": "Zyra (Character)",
    "abilities": "She thinks of humans as no little more than prey and thinks they show no respect to the environments they live. She has expressed animosity towards spirits and thinks they are arrogant. Zyra, Rise of the Thorns Original Zyra",
    "positions": [
      "Support"
    ]
  }
]